{
    "columns": [
        "reviewId",
        "userName",
        "userImage",
        "content",
        "score",
        "thumbsUpCount",
        "reviewCreatedVersion",
        "at",
        "replyContent",
        "repliedAt"
    ],
    "index": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23,
        24,
        25,
        26,
        27,
        28,
        29,
        30,
        31,
        32,
        33,
        34,
        35,
        36,
        37,
        38,
        39,
        40,
        41,
        42,
        43,
        44,
        45,
        46,
        47,
        48,
        49,
        50,
        51,
        52,
        53,
        54,
        55,
        56,
        57,
        58,
        59,
        60,
        61,
        62,
        63,
        64,
        65,
        66,
        67,
        68,
        69,
        70,
        71,
        72,
        73,
        74,
        75,
        76,
        77,
        78,
        79,
        80,
        81,
        82,
        83,
        84,
        85,
        86,
        87,
        88,
        89,
        90,
        91,
        92,
        93,
        94,
        95,
        96,
        97,
        98,
        99,
        100,
        101,
        102,
        103,
        104,
        105,
        106,
        107,
        108,
        109,
        110,
        111,
        112,
        113,
        114,
        115,
        116,
        117,
        118,
        119,
        120,
        121,
        122,
        123,
        124,
        125,
        126,
        127,
        128,
        129,
        130,
        131,
        132,
        133,
        134,
        135,
        136,
        137,
        138,
        139,
        140,
        141,
        142,
        143,
        144,
        145,
        146,
        147,
        148,
        149,
        150,
        151,
        152,
        153,
        154,
        155,
        156,
        157,
        158,
        159,
        160,
        161,
        162,
        163,
        164,
        165,
        166,
        167,
        168,
        169,
        170,
        171,
        172,
        173,
        174,
        175,
        176,
        177,
        178,
        179,
        180,
        181,
        182,
        183,
        184,
        185,
        186,
        187,
        188,
        189,
        190,
        191,
        192,
        193,
        194,
        195,
        196,
        197,
        198,
        199
    ],
    "data": [
        [
            "gp:AOqpTOHufbCm5EZ3ar5URfy7zialFZpm2L7BUP-I6XxTwXfjqMZPfFH8lEdf2f8Cbzf3GELMvVOx912ZGcGLVQ",
            "Michael Borne",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyYeUTtaztSmRlW6NuYhgH-HSj2PaXvefnCNNMs4g=mo",
            "Very exciting, very entertaining! Warns you to take a break if you've been watching too long, suggests you get a snack after too long. Very fair if a comment gets flagged. They pulled a comment of mine, i appealed, they listened, they ended up reinstating comment. Very fair! I love tiktok!",
            5,
            294,
            "21.5.6",
            1633996505000,
            null,
            null
        ],
        [
            "gp:AOqpTOEIxNcg1eCzomzWoa0nS7ldQG_bwRwbZQ365g_01v_-aRME7TaNlWWtcoLy-iZ_43oVsUlRqMUVDoRfuA",
            "Rebekka Kaleja",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgpUnzbQCf34WNeUAahO1qWelnBgcNYO6o1GsP_qg",
            "Recently when I upload videos it just isn't uploading them. I still get the video on my phone so i know i uploaded it but when I check it's not there. This happened to me 3 times in the last week And i always have to find the Sound again then add the saved video and then post it again because it's also not available in my drafts anymore. Edit: the response worked and after the next update the issue was completely gone",
            5,
            548,
            "21.5.6",
            1634059120000,
            "Hi, sorry for the inconvenience. Could you please provide the issue details within the TikTok app via the following steps: 1) Go to your profile page 2) Tap on the button on the top right corner 3) Choose \"Report a Problem\" on the \"Privacy and Settings\" page. Thanks, TikTok team",
            1620965715000
        ],
        [
            "gp:AOqpTOEej4PeNGGGiu5QS-YKfupPVCQfy5CZAbATOza5H-312hbByhVCHRKYXYKYfLdrO-HTCWoUSLqV-mGqiQ",
            "Kelly Nauert",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhMqRyhFnoXggxs6hhvWET3qd6D7F0vuseWejtQEA",
            "I wish I could stop the live feeds from showing up. I also wish there was a way to exclude sponsored videos (not ads, I don't mind an occasional ad, but actual posts by other people that are sponsored are way too frequent.)",
            5,
            500,
            "21.5.6",
            1633957600000,
            "Hi, thanks for your valuable feedback. TikTok team is committed to promoting a safe and positive environment. We respect your feedback and will continuously improve our advertising. Best regards, TikTok team",
            1634183413000
        ],
        [
            "gp:AOqpTOEOMvNexeBaa7-jvgA8Exf-bzUEsLLB8Y1bERiOn1529d0uaK5vdSqYs4qqMsR9WfKZdjivIVp8xz5ZAQ",
            "Sharon Braxton",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiPPMM0awSSWwP1T6I2Wiomcb8kBWFckm0Z9drkGg",
            "Cute and fun, it seems like when i start watching these, i fall down a rabbit hole & lose all track of time, the doggone things are ADDICTIVE! The Beverly Halls, the Beestrom family (w\/the little girls \"eyeboos\" is hysterical) and Sebastian w\/his \"the scary thing about...\" vids....i could go on & on...but instead I'll finish this up by saying TikTok you've come a long way from just silly dance videos!! Rock on!!!",
            5,
            174,
            "21.3.41",
            1633960122000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1634183529000
        ],
        [
            "gp:AOqpTOHAndZI7kLqdTMTUpME_6DU7FASHzPofQWOScn1CzZGmI3Grqe6rxgLdBA8J6w1ke8iO8g-E3_OFvT1eg",
            "Cloudpaint",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjlhZpQOCu8UR00f_IaD1QdiVuzXXg01PvrZn6p",
            "Its awesome. It's a bit annoying that a don't get the exact videos that i want on my for you page but i suppose it's supposed to work like that.😃 The suggested search is annoying and I really wish there was a little tab to pull on so you could quickly get to the bottom of your favorites. It's a geeat app though.",
            5,
            88,
            "21.3.41",
            1633977180000,
            "Hi, thanks for choosing TikTok, your feed is personalized to you based on the videos you liked in the past. Be sure to like videos to see more similar ones and long tap Not interested that you don't want to see in your feed, which will quickly influence your feed with the stuff you want to see!",
            1634183596000
        ],
        [
            "gp:AOqpTOGFCsDbyCWAWLoqx6kjCCpkrOq6VXA5MOydZoEcW_f349Eylt0YawNicYGjps1hZq5lOyck7vT3T7MwrQ",
            "tushemereirwe kellen",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxV_SlVm3KV8MXv8ZnHVCbfiKcXLHCitMxcq-u-=mo",
            "I have had a blast of happiness with TikTok,an amazing app that connects people all over the world.Tiktok is the best app so far one can use to socialize with people,get to know what they think infact it digs into their mind which has helped individuals discover their talents and selves,am really happy to be part of this platform because it relaxes my mind and displaces boredom that comes from all corners. But the administration should be aware of people who report accounts without proper truth",
            5,
            140,
            "21.5.6",
            1633938571000,
            "Hi, thanks for choosing TikTok, your feed is personalized to you based on the videos you liked in the past. Be sure to like videos to see more similar ones and long tap Not interested that you don't want to see in your feed, which will quickly influence your feed with the stuff you want to see!",
            1634183734000
        ],
        [
            "gp:AOqpTOEXKBwELJnC-zaq9Yqn14ge4CGxHiBFl0P4KMKtK3mKsKKFaaIeiIIrxJ-wZIyHt4J5r9NO06FRiTQCTQ",
            "Joselyne Kategaya",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiX8lhzU63_wEcRxJ1v7HgrJOb6SUlpkyDQDkU8zQ",
            "Great app, much fun , I got many friends there, I just want you to get serious with nudidy there, and people who attack others, otherwise well done, it's one of the best apps, stress killer, another thing is about us who have no iphones , you can't use your song from your phone, if you can improve on that, we are good to go, otherwise well done we really appreciate. Looking forward for more features , new and funny stickers and effects Otherwise I enjoy it daily,have learnt alot,we appreciate al",
            5,
            140,
            "21.3.41",
            1633941410000,
            "Hi, thanks for your valuable feedback. We listen to and value your opinions and suggestions. If you find any inappropriate content, please report it within the app. We will review the content and take actions immediately to promote a safe and positive environment for all our users. Best regards, TikTok Team.",
            1634183757000
        ],
        [
            "gp:AOqpTOHPPLH2FlIh4qQNpDTJwCgj5xALhV1LhCoJ3XL61oa6nJUo6-t4bM3PpMj7aproLyEf5DX2jXVBdF1rOw",
            "Shamirah nakyanzi",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxjPo8zn8R0DrrV6oJJRlTaEPbrI1Xg_t_tiiCQ=mo",
            "It's the best app I have in my phone,my stress killer, boredom taker .it's super amazing 🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰I can't spend any day without using TikTok,this app is so wonderful.even if I don't have data atleast I borrow 🤣🤣🤣🤣 OMG the way I love this app is extra ordinary.everywhere I go I have to be active on TikTok, updating people where am are,what am doing and what next🥰🥰🥰",
            5,
            112,
            "21.5.6",
            1633927747000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1634183970000
        ],
        [
            "gp:AOqpTOFuQYoucT70k4-nyjFUQsOIDGc1HFYZro_I5oCgeGpHdohob8vPn0trtXaZtwGaQXObbcUOfN4gYo5Mog",
            "Sarah Anotinette Russo",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiZuWa_mTd3_lF_MstrNsmK_6FPh9UKAZ7CuK03jQ",
            "Hate this app. Barely use it. It took up so much storage. Very inappropriate. Download it to see if my daughter was allowed install it. I thought it was appropriate, but days later there are videos with people naked! Please don't download. I don't even understand why there is even this app. It should get taken down. I personally think it's the worst app for the age is allowed for. If I could give this a 0 star, I would. Very inappropriate words in the videos and comments too! People can messageu",
            5,
            5278,
            "21.3.3",
            1633799826000,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team.",
            1634012134000
        ],
        [
            "gp:AOqpTOHlcUXhdPBH96E7UOgpQ5dTinlTO8ZQG3DF-VRoYgUcwNb-0GLHQPPgdBz3fNHwtHbSdPUNtSzxM5Suug",
            "Heather Blank",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzR2sNcJ0oV57ceJ4fh3Ve7fa29j4j2rBdxpqT0=mo",
            "I like it I started an account on my phone and it's going great right now so I have no problems with the app yet I guess I'll update my review sooner or later but for now I'm just going to rate it a five star because I see no problems with the app so yeah that's all I wanted to say good job to the creators of the app.",
            5,
            32,
            "21.5.6",
            1633976446000,
            null,
            null
        ],
        [
            "gp:AOqpTOFIec63WjqOrjJrvn37mjNF6BWApwHm-G6FsIH7wvoxvA9DxhkVVtbR3qyxe51VHEC0-FZbK9VOhpIruw",
            "Sevda K_D",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi5YkIlN2R1FZrI_J-RM-nMjHlXAs-Bs9WhM9CkWuM",
            "I really like it! Is a really great app and the FYP never ends, soo you could watch for hours and yeah! I would definitely recommend! There could be some bugs that could be fixed but overall, this app is amazing!",
            5,
            315,
            "21.5.1",
            1633705758000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1633833615000
        ],
        [
            "gp:AOqpTOHMZTl67ut6S3cQMu_AaPOTvDFjQWGaHoEK3jQyrWoIFapN1uhBk39VFvt4719vBaOUUu6VD7hj5OieHA",
            "《Suki Suki》",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhyQ9HK4BVF0ly8NiJm9VuimBEgJZJ_xbSrOJkg8A",
            "This app is incredible! I love it so much, you can do so many things on it! If I had to rate it out of ten it would be a thousand out of ten. The only thing I wish of this app Is for a history of videos you have watched just in case 😂 otherwise I love this app a lot it is fantastic.",
            5,
            667,
            "21.2.5",
            1632261940000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1633901482000
        ],
        [
            "gp:AOqpTOGLAPizm54sT5DtrQlQgDix-i-VzNpG4OJIVvthnII4iTry9NuDwdb9Zub4XMrufEhxjmd_Y5_fxlhRhw",
            "Fik Right",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJz_iwFfnvmP7ENKQz8YfapNZmYsHD-sg5U_ze4=mo",
            "Tik Tok is the best app in my phone. In Tik Tok there is filters where by they can make u to. change your naturality so thats good on my side. And also in this beautiful app it has good ads where by letters are readle so Tik Tok is good for me Even the it has good sign and colour for easy identification Its easy because it has futures like that sign + we all know to make videos we use that sign Its easy hw u can make a challenge with out making your own video And I can contact friends usingit",
            5,
            112,
            "21.5.6",
            1633933023000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1634183831000
        ],
        [
            "gp:AOqpTOHlzRk709yUeBf6g89jjgCtewIfyCBfRSGoJqq8-tKq91sUC3VAy3Fengtu2XoSFNw7PyeYn0HWkypCqQ",
            "Rosaleah Urena",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi5dj-qXgKqDR6lNMixxIlwIu2UH85NRwiD9jFg",
            "This is my favorite app, I love it, and I started using this since I was 7. Now I'm 8, and I'm turning 9 in December, and I can't wait, and I love this app but one reason I don't like about this is like, sometimes it's be really glitchy, but it's not my phone because I'm always at my house and I have goodWi-Fi and, yeah, but there's some weird things on this app, so y'all need to like, do something about that, but I really like this app. I can't wait to turn 9 and I'm really excited to turn 9",
            5,
            63,
            "21.3.41",
            1633856954000,
            null,
            null
        ],
        [
            "gp:AOqpTOEjqeI2d4Uoxw3fZ9YJIfeSJ2OuTGMJ4kYrZlSYSxBL2joEWo_35gBv-UHVIomiqzr36-YyAaSTjXXP-A",
            "Jacinta Manning",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi5fS-fufehUTEVvFMbq3VhwOwKv4ZojPTIlBGJag",
            "I love this app it makes me smile 😊 everything is grate some problems but the biggest one is that there's a photo crop filter but it croppes inappropriate areas of the body and is scaring people there is probably even a death story I heard about this filter but there is other problems but other than that I am so happy with it and hope one day I will get 1K followers this is a good to get app , worth downloading but there are bad adds one called: \"get laid\" there's kids on tt abt stripping👎🏼",
            5,
            461,
            "21.2.5",
            1632353916000,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team.",
            1634012297000
        ],
        [
            "gp:AOqpTOEVvy6yJtgF16NrJKXejavFvLJsirFG52mANh4CCyQDlh50l4ftyqjnI_nlduDVUOKoxTFmCcM86EzNlw",
            "Naziz deejay",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzcyNxKxRGgtZfq8qyMUMJRHIjVnlpurfUysYRz=mo",
            "It's the best app ever, full of fun, learning, and the best to brighten your sad day with smiles. Too speedy good effects, good challenges. Ijust love Tik tok. @deejeynaziz4 on Tik tok.",
            5,
            26,
            "21.5.6",
            1633928777000,
            null,
            null
        ],
        [
            "gp:AOqpTOG7lmE7n9lWIStpAIGWy-8jcw5s8NO33cqB6vVatMhMJ65WJa8g7IuJjRZx7yjv0YfWAqOG518RNCADsQ",
            "Lee Gregory",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GggRh-I3mgPc4RvpucWjnc5C4k2mzQgiHE_jDOIKKg",
            "Life changing! 🤣 So many great videos on Tik Tok. Didn't think I needed another app on my phone but this is great and easily lifts your mood (if you filter comedy videos) equally it's very easy to filter to videos of interest. Definitely recommend.",
            5,
            29,
            "21.3.41",
            1633928113000,
            null,
            null
        ],
        [
            "gp:AOqpTOElOAF0r7kKUIfHuQnSVzDDDsxoE_beudBX1anDS9nKV6ZQ3g-j6iWmenWn3d2uobfXweswydIHqRAMhw",
            "Carlos Rodriguez",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJy0Y67-6YqPZ9YS6WLqKHiR8JTdsyRyqTiV30cz=mo",
            "Using TikTok has helped me maintain my sobriety through creating music videos. I know it may seem odd saying an app could help in rehabilitation. However, it impacts my life in a positive way to stay away from the streets and focus in something bright like dancing and spending time creating these videos rather than getting high in the alley....",
            5,
            245,
            "21.2.5",
            1632702832000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1632986611000
        ],
        [
            "gp:AOqpTOEDOYBDM7VFVyVnAMJ7Qp28Ub_HKbCc53lvLnt5rwSFDC0dSYYb-LG9V0pXjTA_q_haUqQYSoBNwUQECg",
            "only bonjour",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgRD_pf_4lUrgBpirXSQjvn_0RmC3fN1luG-7mD1w",
            "I went in with fears that held me back from getting this app. While there are areas in need of fixing I love it. I've found community in so many places on this app. I can see why it's popular. Well done I will admit.",
            5,
            13,
            "21.5.6",
            1633911250000,
            null,
            null
        ],
        [
            "gp:AOqpTOFOcz4RcPFY5ZIGhp83-nHmW3bfP4in4hd6EJS_u8fWWQ1gV8CcLI82PZvC472OM4VfEtfWmxR4Zvrv3w",
            "Steve q",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi3Rav8N7sZOSv4TXBLdP8tHrg2cRvjcjQRLmL24w",
            "It's good.... Would like ability to have bottom + part to lower when just watching videos..... Have burnin where all the static parts of screen are and my screen brightness is set to low on my phone.",
            5,
            13,
            "21.5.6",
            1633947208000,
            null,
            null
        ],
        [
            "gp:AOqpTOFO6flHdC3g0izjjGXGc-0Dn0duCDezSUj0jlMxEQNlBWpI73hlJDDEtvCHc_-TydplBEB-QZ_BtC9X0A",
            "Amy Baxter",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyv-ELqIcQtAWj9IC9k16ghSIDWWnR4jI1G8ZY4=mo",
            "I think there is something for everybody on tick tock for me I like to watch dancing the military the canine and other dogs other animals practical jokes horses and more. And if you don't like what's up you just tap and go on to the next one right at this time I think it's pretty neat I'm glad I tried it. I was told that if I get tick tock I would get hacked because that's what tick tock does so far I haven't been hacked",
            5,
            74,
            "21.3.41",
            1633685095000,
            null,
            null
        ],
        [
            "gp:AOqpTOFa4_XXWeof9mfalo_ukohfmEudj5kSvdE1T3vI21if-NwDoVY93Ov0nf-9p_WAl6-Al1CbojbX-NJbvw",
            "Sandy Knight",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgokEbne_JQaHXTPeGs-0q3OLXYixIuwMFUnJHz-Ok",
            "I love this app. However, my daughter does TicTocs that gets taken down when others are showing alot more skin and sexually provocative material that doesn't get taken down. I have a serious issue with that. It seems like people with alot of followers are looked past for doing very sexually explicit scenes. Please be fair to EVERYONE. 🙂",
            5,
            192,
            "21.2.5",
            1632671179000,
            "Hi, sorry for the unpleasant experience. If your video contains inappropriate content or violates our community regulation as specified in FAQ https:\/\/www.tiktok.com\/community-guidelines?lang=en, this video will be removed. We hope to see more good content from you! Thanks, TikTok Team.",
            1632986638000
        ],
        [
            "gp:AOqpTOEl_WgXKfO6GieZXjNYahUhNIRBmkpvFbGLuHPY9O_FJXvFjQlzK3O5KvS-4pbJNLdRJ8d4k2yH0FFlPw",
            "Artese Johnson",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gh-ngn_vEaG_7-8gyDxMJFNdB6n21swyutH1cGORJs",
            "Still learning the ropes. I'm older and each new platform takes me a good min and several YouTube tutorials to understand what to do, hence the 2 star rating under the optional \"Tell us more\" question about the ease of use. Once I learn, I'll re-rate it.",
            5,
            424,
            "21.3.3",
            1632439863000,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team.",
            1632789191000
        ],
        [
            "gp:AOqpTOHRKg1bvVlDKNImzuiRdWUpTEAM7uDQsmeSLaVyZezyFVrhzyPO9aP09vWEEKkAjN2r4kbaVXrFhNKwpQ",
            "Aisha Namayanja",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwJMp8GgSbYtjkcsRXYB3_0ZSYU3J3ghRrpNePY=mo",
            "Fantastic app I have ever used and I really appreciate it it's easy to access and use it has many interesting features and options I love it and that's why I'm still using it",
            5,
            26,
            "21.5.6",
            1633961762000,
            null,
            null
        ],
        [
            "gp:AOqpTOElvTs9cgZyvRLaVYaauuEf9g9CA-QAqZzyPccfwWiVjOBKAanM2N7cUvuknTG0atoh9WGKeBAv8wV8uQ",
            "Pepsi Demon",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgrTUIn2iTcSISxAe2AodlPl3VsiO5HgZRC3Zs_tg",
            "Amazing app and very fun! Some people ads a bit rude thought other than that it's an amazing app. I love to watch the things to pass the time because of bordem",
            5,
            20,
            "21.5.6",
            1633908950000,
            null,
            null
        ],
        [
            "gp:AOqpTOG6MAf-NyUeE_anatTTo4oGO3QRkhDwcCngviRmwUT-QItb9FNonh4nJwXh7qvKVDYlGxzc55eDlT_RWQ",
            "Nantume Barbra",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxdA4ZZ8GIhcJFGyw2_oOQGXcDZKDpAlk2kpn_o=mo",
            "TikTok is the best app ,so fun and it helps some people to bring out their talents,and it's also a source of income to some people and occupies less space ,keep up the good work",
            5,
            13,
            "21.5.6",
            1633946368000,
            null,
            null
        ],
        [
            "gp:AOqpTOEk9HyZA9kq31ZrIEKMzbrwRo8iK31bw6iylkvHmIZpKwHM02M5eSlm8IHv7KOSGjpa20Se0wnodh4dyQ",
            "Princess Agu",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgWaWX5agY2-O_OkApHF0kXQdAORJzPCqNxKvFxHA",
            "It's a time killer,it keeps your mind occupied,it's help reduce the rate of idleness because TikTok pay,you earn on the app, through live video gift You meet new people, chat with new people,and it's even allows you create something unique for everyone to see, it makes one famous...wonderful people, everyone trying to put a smile on another person's face🥰🥰🥰,by been creative in their large or little way, The love, support on this platform is immeasurable.... thanks for creating this app♥️♥️♥️",
            5,
            331,
            "21.2.5",
            1632394213000,
            null,
            null
        ],
        [
            "gp:AOqpTOE__ntw86ZMR3kKRDBapdmuKlLluTCYxzYVUmkbGIlmh-kWrYRucUuChBwXwD8MMZnWtk6hC2Dot-KnxA",
            "William Billich",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj_a1LMKZGyMxZjk1DZ8Psd6smUrgHdZ4GTqlu8rg",
            "I thought this app was for 13 year old girls, which is true, but honestly there is some good content here too. It is a major way the younger population expresses important phenomena and ideologies. You can use this as a distraction or you can use this to learn something, make the better choice.",
            5,
            360,
            "21.2.5",
            1632309981000,
            null,
            null
        ],
        [
            "gp:AOqpTOH4pcqJZKo5CTVsCgT_ud5ie7omm-JTqyjoHIKVzbQ3sJ-KsPl33YAqZgLCAta-KhyWsiCRjz2kxmZg8g",
            "A Hutchinson",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxxNW5i9CFFbHzvzopZ-lgJ_nr6LqQx3kbt1dr-=mo",
            "It's a really good app.very enjoyable to play around with & create.the only thing i'd like to see added are,instrumental background music without the artist singing.if you wanted to do your own take on a song,u could add that to your recording.other than that,i like it.👍",
            5,
            202,
            "21.2.5",
            1632377630000,
            null,
            null
        ],
        [
            "gp:AOqpTOH05Gp2CwgVhygl3EVk1QMK3FiH1BvUQuq2WBQ3lWy0tfIMm42sNw6-QsTXyVvuT-KVA1AtH7zNHgs5vQ",
            "Necherem Anene",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi1I2BTyAb9jt-VgyhlMxR-w9Vcftx6yI89fwaZtQ",
            "Amazing app But I think it should have like a place to set time limits, so if you set that you want to use the app for 15 minutes that'll be it and before you can log back in will take like 10 minutes Because I be telling myself that I want yo use it for 10 minutes and ve doing 3 hours instead But the app is amazinggggggg",
            5,
            137,
            "21.2.5",
            1633329404000,
            null,
            null
        ],
        [
            "gp:AOqpTOHcuthwM0goZccKlxPl6FcSROxtNTDmU6jSG1WWmmzsR9trbGtdlSBa1gB6EU5SMCEZPPx4_zLt2sz9gw",
            "Leeandren Lee Naidoo",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzucytHK2Unlf0eabjupMnNFP7lU1DujOz8EfPG=mo",
            "Its fun , it's addictive and absolutely amazing , great platform to just share funny content , but also great for sharing life experiences cooking tips whatever comes to mind ...and I also great for Dancers like myself to put ourselves out there",
            5,
            50,
            "21.5.4",
            1633882371000,
            null,
            null
        ],
        [
            "gp:AOqpTOEqrpZJzEfSiBQ_EMVPZQRiURVy1PY8d0Q9jVNNhHw8OJ-Hnu0pthpaPfnpvmVdxaRb_l3EGZcMZqgEpQ",
            "nikki bxmbshll",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjdQ9vLzJuYgzNNmcDi6F2HaCJSqo-M_PgD_AsmYg",
            "It's a great app but y'all need to renove the \"report by holding the screen\" option because when I'm trying to send likes it sometimes reports the video. FIX. THIS. PLEASE. people are getting accidentally reported by MANY and getting their accounts banned. FIX. ITTTTT.",
            5,
            9,
            "21.3.41",
            1633945163000,
            null,
            null
        ],
        [
            "gp:AOqpTOGvptR8Us-LO3HHCCHdEK60AUyEOwyqaa8weoiY-ENx9b4u5QxNje4XGaWPsBN74lkLvoK7DVMNzrkg-Q",
            "pep pep",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgAgU7of6q-XvLqv8BCRKK9bhHJIHLfzMHKv99-",
            "I feel like this app is very helpfull and fun. I like how you can pick what you want to watch and make friends i have had tik tok sense musically. I recommend tik tok.",
            5,
            10,
            "21.5.6",
            1633957140000,
            null,
            null
        ],
        [
            "gp:AOqpTOGwNtTG7ExaPzFKrFxkmpcktgirHfhRen1_P1unqNvvP5bXPGcOk5xejr8kHMXSqnQ-1GhzWCg6L42t5Q",
            "Mukisa Veronikah",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gjk-pXjW3k4chb26zeLpI4BF7GoXTcPRnjnRY28",
            "Its a perfect app where everyone gets a chance to express what he or she can do best. And besides, its a stress killer every video is funny.",
            5,
            9,
            "21.5.6",
            1633973490000,
            null,
            null
        ],
        [
            "gp:AOqpTOH2yZ-vxO-xPZRjsn-gOkHFs9t8NevfJgS0iXZ5mVzmW3lpiecvON-SwLPeoA3bDQGU7FhfMK68OSz0rw",
            "Cithaly Castenadea",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxtCo_8Jm0FZRJOxyrDqzGtmT7Bs2m81E5VwJb0=mo",
            "Tik-Tok is the best because you get to watch videos you had to do your videos videos and if you're like no tiktok to you know how to like it into the document your own as hell as pretty as you can put Google Instagram or Facebook and you log into one of those and I'll tell you so easy to log in and giving this 6 star because it's the best make YouTube Analytics cry if your nail and if you're know you'll probably like it I'm not no I didn't I didn't mean to talk to jail for like 4 years now it's",
            5,
            21,
            "21.3.41",
            1633801648000,
            null,
            null
        ],
        [
            "gp:AOqpTOE2kYPzJ2rV558cx9qJYIwye4-ajqv8mobCbAZhvVbjR2Jo9XFjBjGRhOgTvUm2h44ENEwoJaULXBOwtQ",
            "Caleb Arnett",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi8-VdWzclWSfRtOQpyYQ8VlylSPCJYl8LlN2S69g",
            "Overall it's an excellent way to reach a large and I mean large audience there's no other app like it all you have to do is follow other people and it will just instantly be inclined to follow you back the way the at work so if you have several servers following XX amount of people look whatever the most is every day every minute of everyday ultimately you'll have a huge following in no time which will ultimately do an excellent e-commerce plet me call much platform where you are um and call it",
            5,
            137,
            "21.3.41",
            1633561258000,
            null,
            null
        ],
        [
            "gp:AOqpTOEFSe-6y79FON0uBwBQkiYaubSV3focymohJOk5eh-W-35t7VuK7rqXchu3_6LIWgq3eIpO56CLteINMQ",
            "TX Burner",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gg-YF7m0ZhwtPR4TXry6pPPgr487s05eVnJJ-cmAA",
            "Five stars to please the algorithm. Beyond that the only two ways I've seen people get over 5K followers is just reposting screenshotted meme videos from YouTube or having dark areolas and a sheer shirt. Changed format completely on a new account because the one I had involving talent at all, well my content kept getting taken down for dangerous acts yet I find kids with alcohol soaked hands lighting up. The oversexualization of children needs to be addressed. Five stars who cares though right?",
            5,
            446,
            "21.2.5",
            1632220662000,
            null,
            null
        ],
        [
            "gp:AOqpTOHSmJL8aCzAIuVCdUjzzbWo2rZ79ArQGdOYoFTlaRj7rvbDmp55PsYdHpZQkBujv2dWWbki-0q4GsdIfQ",
            "Sophie nah",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJx0mb8dDJ8L62cfe_FMxjj2P3XULGbK_BJt-lep=mo",
            "Apps great but auto captions are gone and there's no way to turn them back on? I've searched through the settings and seen others asking but they all talk about \"a little rectangle\" in the bottom left that doesn't exist on Android I guess? I'd really love the auto captions back",
            5,
            91,
            "21.3.41",
            1633425865000,
            null,
            null
        ],
        [
            "gp:AOqpTOGfH0FHD1JIW59tJe6vf2_OBwtq9V3YeRx-QELrEtaMqH-edLsMVp5LUtoFkdSS0uru44MX5836K9G_Qg",
            "Michael Hicks",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwjrDh8PkKE-syZlpONL4n-vYUH7ErTu6O5EsyB=mo",
            "I absolutely love this app. It allows you to connect to SO many people and gives you your own platform. Keep up the good work!!!",
            5,
            8,
            "21.5.6",
            1633934272000,
            null,
            null
        ],
        [
            "gp:AOqpTOEQu7LfCVvAHdYH8GPdwSvtToGQSDyuYeOjx4N7hYuuGEVNqR89i9PjATeCUx2mJmnIW_Mxl0SCwW15Kw",
            "Fentse Modiba",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhyOp_SjOZkUeQiIsz_p0hq6FLlNWJ-WziIErmL",
            "I like the app .BUT if you look for a sound or dance you won't be able to find it because like it will take a lot of time with with or without unlimited all Wi-Fi it will still take a very long time like me I've got a Wi-Fi and it it doesn't do it takes a lot of time I don't got the time for this so yeah it's so nice up with a nice happy that it's nice i been happy with it",
            5,
            168,
            "21.3.4",
            1633141310000,
            null,
            null
        ],
        [
            "gp:AOqpTOHbI8AFrhqgj2IFrXaOeuokz7c1A3dPGBE_HPYFhTJN4rA8dpnO2r0d_-gRo14bI4WJV9mgeSGDGQG6sg",
            "R Tolbert",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxOonkLHffZLRHf-FtjnQDSuxZTi5GaS2S7wmxg=mo",
            "I guess there's some problem with my service because I had Tik Tok before but had to change service and don't know why I'm unable to connect? Maybe if they would\/could send me a link I could try clicking on once that may fix everything for my new device and servoce? i certainly hope so ?",
            5,
            104,
            "21.2.5",
            1632932299000,
            null,
            null
        ],
        [
            "gp:AOqpTOGlL0oVVADigXBOILy7yeVb0PyqxhDmvAHgTaq_ya4IMgDhxFmGCLs9--p8MWXKpRLLch3pNEhWRLIVbA",
            "Jo Chumley",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJx_OP-oY0nAdyFUBsFCb82H4QEHbwam9sbaQOFq=mo",
            "This song played and I cried while I clutched my heart my... Played it over and over in still smiling 😊. I hope I can remember tomorrow how I found this! Thank You for making my day end on a Beautiful NOTE 🙂. Could you please send me a message on how to get back to this ?",
            5,
            123,
            "21.3.41",
            1633570054000,
            null,
            null
        ],
        [
            "gp:AOqpTOHs0UWFMAbCb6BsWIkv_3BYcBpOtvS_tg7IxnQajj9_Vd-drRJh4U_oZGt9lFlOPnsfZ0vLb-2Hrf5uCA",
            "emmaleigh vignes",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgkBaiqZwCqYCmD122Fo-GoCpVLGFICJkhrw5U5",
            "Great app! good for Its easy to use. Fun for making videos. The ads in the app make sense and the ads dont waste your time. Its free to use. overall this app is amazing I 100% think this app is worthy of your time and you should get this app overall this app is amazing!?",
            5,
            44,
            "21.3.41",
            1633614277000,
            null,
            null
        ],
        [
            "gp:AOqpTOHkslMJ16bSGK9RnOEtA64UtceZhuck92HRmL3yyaGXvLvDGREZ3qfCeIvjlSeYF_MWRUzHhEHP8cL1Og",
            "Charlotte Causey",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiFrPU4BSRUn1ehLLjQWH_F8Nm4U-O60nOZqNyFUQ",
            "PLEASE READ ALL!! I like it a lot. It's not as bad as some people say it is. I only wish I could become \"Tiktok famous\"...lol. Tiktok is a great app meant for uploading cool videos and using amazing filters. I've only just begun my Tiktok journey, but so far I love the filters and features. Anyway, I really recommend downloading this app, and if you do, try downloading Zoomerzang. It teaches you how to use some really cool and fun filters. (Also, find me at animalloverhere1.)",
            5,
            145,
            "21.2.5",
            1632514844000,
            null,
            null
        ],
        [
            "gp:AOqpTOEDQ9__FJihY_0V4iwqy4P2OK8tGVR1tFBixYbnsY3FmxNyewvxi4Yjd-ZCiyecVPB8MKH-DpWG5QLLnA",
            "Asiah smith",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxg0fN4BD2VU2O516AFLOQTOEpyZ8_ZMQi9fv86=mo",
            "Great app works really well so many features so many new features lots of popular trends and so many things you can do on the app like find friends, post videos, get likes ,Duets, shares, and so much more so yes or even get sponsored on tik tok besides all the scams the app is pretty content and sometimes the foryou page won't load but other than that it's a great app that continues to improve so yes 5 Stars",
            5,
            278,
            "21.2.5",
            1632046247000,
            "Hi, sorry for the inconvenience. Could you please provide the issue details within the TikTok app via the following steps: 1) Go to your profile page 2) Tap on the button on the top right corner 3) Choose \"Report a Problem\" on the \"Privacy and Settings\" page. Thanks, TikTok team",
            1632182583000
        ],
        [
            "gp:AOqpTOGfRqvlM4ursyeb3rv7A-zsO2000E9hG5w3qaN44kmpxxG4jsyobcqXcaBJbZd_0Z7jhN_L3YW0w0yPbg",
            "Todd Murray",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhShelKGYIcyP9RfMmBt0RXbBbK8l4MJzo9AIczlw",
            "Pretty decent entertainment application, that allows the user to share across all their social media sites. This is very important and helpful for business owners to be consistent with ads. It's also very entertaining for all who use it",
            5,
            310,
            "21.2.5",
            1632580579000,
            null,
            null
        ],
        [
            "gp:AOqpTOHpASxr69gIS2m4owJgI-65bLhe-ajFQ8K8VKTZ6DsrBAFTALCO12rd1e3wekwApGiGZThaTKszuXFxUA",
            "#STEVIEVEVO",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjBQs9VFAeouZmjLBAILR7Jhm0DdLtghK6bzMC-BBg",
            "The app is great but why would you remove certain features like having followers contact you. I mean if people are complaining that's their issue because it had 3 options... but either way I love the app sad that I can't get to use some effects due to the type of device I have but overall. LOVE IT!!!!",
            5,
            88,
            "21.2.5",
            1633029108000,
            null,
            null
        ],
        [
            "gp:AOqpTOFlmIQrT_X-3EDdnvyO1Pl2CSJIFwDKoytfSq_FOqmU--Zpc3tpw3x8MYtwTi7vUC55aEP5jonz-baJcw",
            "Mark Williams",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Ggf4ivlDplLIBjQpDwoM0ndONyNAfFLm-kkj0rOCQ",
            "Latest update needs some fixing. Videos not playing properly. Breaking up after 10 or so seconds into them. (Not all, but some). Have uninstalled and reinstalled the app but still happening.",
            5,
            134,
            "21.2.5",
            1632365218000,
            null,
            null
        ],
        [
            "gp:AOqpTOEu5b-6IqHXJDBzq7RMUdABkubCfQCb54sZwG5P1T3hIaDNKjWNpelM00NBnK1z_5UT6_lTCI406IVLnQ",
            "Yaqeen Abdullah",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgA3I_g7im3SNQtwX0x3go8lLw1d60e56zS5hE8",
            "Im new to TikTok, but my experience so far, is absolutely great! It's easy to use & I think there is a little something for everyone. Very soon I'll be uploading videos myself!!!",
            5,
            6,
            "21.5.6",
            1633955569000,
            null,
            null
        ],
        [
            "gp:AOqpTOFbJq7jqqdpMIrRumZvq1zmp-8VFB9oEuqDV9TR2_B8TY-1CdBwoBvMWWH5hl0ddfYRyr0qOfSU5KmJfg",
            "Nassali Faith",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gg4DfPN2MUWcK7tKwvcTNRj3NsDbfIKsNy_fUE3",
            "It's really full of inspirational facts and fun, it introduced me to world of stress free and socialization as it brings new friends. Business ideas and the word of God, it a better place for leisure, the music hooooo",
            5,
            8,
            "21.3.41",
            1633878890000,
            null,
            null
        ],
        [
            "gp:AOqpTOHtoXG_701_rPiTRsiYnHMXDm-1zNWBtT3eSQqS-E8Neei6Sn4V3GOwnHXyNU3GesfIJN8eDY_p9Pu-NA",
            "Saima Irfan",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxLEaoEX6H_aPfX6Tnns7-cZRN23bN8RyV-ldJ-=mo",
            "It is a great experience to show people your talent and creativity and learn new things and many more......but like always people manipulate more on social media than in real life....but that's another problem, still this app is great and i appriciate it",
            5,
            362,
            "21.2.5",
            1632497222000,
            null,
            null
        ],
        [
            "gp:AOqpTOFKewBjFPLeoyte5XycvZvuESqXLwA0s8O-pIUrm4mif3IqiCJpQ0NpZKHJWgM3fydw4G5QyMo-ZEtR7Q",
            "Angelo Nelson",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxO32WZ-0I03vRsycBIZ1frmAGugnh9iVGJmGLh=mo",
            "I love this app, it's fun, and it could be educational, now that is the stuff I love to see on this app, I even love seeing the try not to laugh ones, cause it always makes me laugh, fun experience!",
            5,
            3,
            "21.3.41",
            1633987079000,
            null,
            null
        ],
        [
            "gp:AOqpTOGUolbSDmkERP30rK15Su5Xd6y7YdGlmLLIB08zxoI09VAHgF6OLIkhhC6p3dot1z3kojzg2Q0Eq-00Bg",
            "Alpha Mukasa",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzTd1vMhi2BUjHezprxBzSW8g__9ur1kfX0ykul=mo",
            "It's a great app,easy to use for communication, advertising of all kinds of businesses,meeting and creating new friends and it creates happiness with in our selves .",
            5,
            7,
            "21.3.41",
            1633938848000,
            null,
            null
        ],
        [
            "gp:AOqpTOGI8z8TZQe6gKPmhKB-MtwlAYMQPKqoTWYj97AmuGW9FSZcyWYLOsKhXxwYa79U7bf_zDnFvL18DoywRw",
            "marcus m",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gjk9tNv-Ftio8HRs1GbsX4RuLmaJP6V0_Iq7F5ryA",
            "In the 3 months or so since i stated following tiktok, I've enjoyed the ability to either fully enjoy what i previously decided to follow, and the flexibility to quickly delete or scroll past commentaries I don't like.",
            5,
            3,
            "21.5.5",
            1633909952000,
            null,
            null
        ],
        [
            "gp:AOqpTOEHaUZyborDk5RyMd79qlrqCKar3fyqlrASMwH4gUARIixyBBZdvX34ZoYoP2EIuECg9eN4Mjl9Q5_N_Q",
            "Melissa Filtz",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhZRukriKmQKgoRSwABQKYIL0z4SGIQno6pLyOU3w",
            "Love how you can control the algorithm in order to stay on the side of Tiktok you want! My feed is filled with all things good! Love it so much!!",
            5,
            38,
            "21.3.41",
            1633417168000,
            null,
            null
        ],
        [
            "gp:AOqpTOHK-cR0FwYMCk_KJhNVt1lkDcbsE7bfESlaJAQsS7vAEzIHqWdDayaVUwf6r_5zUP4BN4cpiEGOF33fKA",
            "Dolendra Chhetry",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwf3sykWtYtkS9h84JtUc89SdcZbt_80Gg7SwkV=mo",
            "I love TikTok, but I have an Android and the recent update made my experience horrible! Now I can barely post, I can't see video without having restarted my hope this gets fixed soon! Also, they should make it so that anyone can go LIVE, not just user over 1K.",
            5,
            302,
            "21.3.4",
            1632867085000,
            "Hi, sorry for the inconvenience. Could you please provide the issue details within the TikTok app via the following steps: 1) Go to your profile page 2) Tap on the button on the top right corner 3) Choose \"Report a Problem\" on the \"Privacy and Settings\" page. Thanks, TikTok team",
            1633136717000
        ],
        [
            "gp:AOqpTOGs3jCmLbgcFBzL5HlIBAuYCrsqWus2qx-4hdiZEIDYn06-NAwySxzYiqNBKxfwVOF7fH3NCAcCl3UItg",
            "Mohamad Skayneh",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhAvlFLH4HgEl8uFVhYxXOBmH_p9wlBrhaWKwK2zA",
            "Something new and made a huge step in social media where it mix all the audiences and participants in one place at the same time without any complex but a simple usement.",
            5,
            2,
            "21.5.6",
            1633954271000,
            null,
            null
        ],
        [
            "gp:AOqpTOFIpsMnq4weV9z2F8VlLlusL_DZOcf-S_ssQW6T7EvQYU337cWEaOFlfryLP7tfzyY3rKnWlUpJj6mzRg",
            "Natalie Gregory",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiNnYhIGvpbS98ZUrbjZC73G-qYkgZZm5ufJmbQOA",
            "I love all the different outlets in tiktok. There's millions of videos for crafts, cooking,comedy, makeup, sports, CLEANING, I mean anything you can think of. I love the variety and learn so much on some of these videos... Others not so much but hey they're entertaining 😜",
            5,
            105,
            "21.2.5",
            1632264733000,
            null,
            null
        ],
        [
            "gp:AOqpTOF65bzdTjS5UW1OZI4WS0laSk39do1N-3K4tOpAp1iryUh0FlmT5sachIGxU5k4lqe8sP9V3Z7b9lb0DQ",
            "A L A M I N",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgfeYdhTWFE_XPbz0Kds4n3JbrfaYTnDqIQoxoaXw",
            "The app is good, but after a few days, the video is not liked, the ID is freeze. So solve these problems as soon as you can. Make it easy for small users to get on top. My TikTok ID @abdalamin101",
            5,
            249,
            "21.3.41",
            1633304434000,
            null,
            null
        ],
        [
            "gp:AOqpTOHmvl6sW-U-T8nGSEjQuhEUXnmUrJRzydamzHkhbKyyFwgKcc727_Ljqn9WAyQGCIVLhYkyX5Ak3aW9xw",
            "Luis Gabriel",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gg9MQAqFXZOxWB9YQ4T7aIVsHlAOJkXEf_prrjhmQ",
            "Entertaining if you know where and what to find. Notifications are often away of what I could be interested. Flawless functioning and features are quite easy to grasp and get used to.",
            5,
            51,
            "21.2.5",
            1632409368000,
            null,
            null
        ],
        [
            "gp:AOqpTOEWFKVk0L7Qw8BIwINNSNGdx48mDE8PFioX7vCooIbH5wt-6HEhLR--7codx60LV7NyOf3Jf4_stTYmkQ",
            "Kyle Elu",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJx8AFdKdN0USwKLvGlfhAOXfvrFIxZtZKhw8R59=mo",
            "This is the best app ever,you can scroll non-stop its very amazing how people do such stuff, i love it so much had to give it 5 stars.",
            5,
            4,
            "21.5.6",
            1633873060000,
            null,
            null
        ],
        [
            "gp:AOqpTOHCB_mpAxIE6v1VhkyjLJ7V-31YfRh0p-CT8H2-XsDl_qBjmjM0WByOQFkIRLFYQx5XUWCTBREsCaudYw",
            "James Jones",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwOg5DyKxEEthYfmI65E7HvjS6sPCdEsiys9Q7t=mo",
            "Outside of the influx of scammers with their young fake model pix constantly bugging you it's a great platform. Solicitation is a federal offense when done over the internet. I report them but, scammers don't seem to be a concern with law enforcement. Outside of that I hope they keep allowing us to post our freedom to express our opinions under the Constitution unlike other platforms who are politically one-sided.",
            5,
            24,
            "21.5.4",
            1633703416000,
            null,
            null
        ],
        [
            "gp:AOqpTOEx7_3L-70CUZHq9z_GZPidQ89dzjsV6HUTAeg-v8GFsRiymZXD_0GtBuAw9bzzqvko-xo5lgOriuS2nA",
            "Julianna Rigali",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwPYl7sDsnjGGGkrFwc-FrVRTDaQQ4fLhu1dMUX=mo",
            "I love everything about the app, but when trying to edit your bio, you can no longer add links for link trees for example. I would like to add a link tres but I can't like I was able to before. other than that, it's a good app.",
            5,
            189,
            "21.3.2",
            1632020044000,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team.",
            1632349690000
        ],
        [
            "gp:AOqpTOEp0Ju4bktYFrAcwtRrbjiPxsRqm4NhtfZcIBSixb2vrOap6XtI1MMmcLaWZw-_dE_DhNk29nvvqXr_gQ",
            "Alyson Cook",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgGMKG-2OKkzr1Uy7gKx1yfWJp225UNLYaRHIeL",
            "I LOVE THIS APP i have been on this app since sep 2019 so a WHOLE YEAR woah time flys with tiktok I love it you can make new friends and you also have the choice of making your account private so when someone follows you. You have to press accept or decline to let somone into your accunt to see your videos or you can make it public to where anyone can see your videos it has an amazing choice of music genras and it also uploads new songs everyday witch gives you many music choices. 100\/10 get it",
            5,
            72,
            "21.2.5",
            1632524648000,
            null,
            null
        ],
        [
            "gp:AOqpTOHz1qlpnaPKUWxhKZwuI01ZIRlqx2ms2LDxaB9BO77Lx1IgyEBjZv86G-a4VsGXAtcHfbz8Bu2FPpcggg",
            "Myriah Moore",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gh2M9zxXgE6hgVhHXNkhFAOcveedpGXXqTrZM5RTA",
            "I LOVE this app. Not only is it super fun to watch but its also a great way to reach out on social media and spread positivity rather than negativity 💜 my children also thoroughly enjoy this as well.",
            5,
            7,
            "21.3.41",
            1633940966000,
            null,
            null
        ],
        [
            "gp:AOqpTOHxRdKdlVaNuqTD8eoakXIDn6dmyUxWnaBlDvFwl71m6GwpqDXS_PJhzVe9EZ5Suza0SCJdMEu6vCkqpg",
            "Kayla607 Wright",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GizaPrWkpCPQdkC1OE8gYQ3HFqEYEPlkg3HUjax",
            "Tiktok is amazing it's a rlly a place were I can vent out from. I also wanna suggest something. Can you add a feature wear in record thing you can search filters. I think it would make things easier instead of scrolling for hours to fing the right filter.",
            5,
            113,
            "21.3.41",
            1633259933000,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team.",
            1633569716000
        ],
        [
            "gp:AOqpTOGhizgRW6CiGSgf09CajLh-r8j5jYiSOLwgSQIDWk_TYgyyJqys7WheSmmwN9JUUF_VEjBKn4hyo9h3DA",
            "Benny Shilling",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzDvoApwnG4nu2ObzVMULAXucj2pW-JP-WvQUcj=mo",
            "This app is more than silly dance videos. This app is also extremely addictive and my productivity has suffered because of it. I feel like I learn a lot from Tiktok but i dont really retain any information. Anyways...adjust your digital wellbeing settings on your phone to limit tiktok.",
            5,
            67,
            "21.3.41",
            1633781690000,
            null,
            null
        ],
        [
            "gp:AOqpTOFmJkfbLHcx370sGPJtYMxrZcuF1qV6mH_krOaVAzdXW7VARdZ5V0Bmr9wqOl07KZt_nzCfjGvTgOFSEg",
            "LAZER FF",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj6_pQKXjBLJq2rVa3yQnUrW3Jig05LAvNcXtiD",
            "The app is great and everything, but if you can change the age to recharge coins from 18 to like 15 or something is would be great!!",
            5,
            2,
            "21.5.6",
            1633963813000,
            null,
            null
        ],
        [
            "gp:AOqpTOHjEKNR597i1RS3wtuZ2nHXD5nZ7jJ94AyuRXGFXSnFmtEyexbmb777Oe3HpNPP_zI8GvUv0kpkkaReIg",
            "X_ZOMBIBOY_X",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgWWSx4Jei1YFLBn_Uuhpu6AAB3uKKsCVRfR4q7",
            "It's honestly my favorite app, yes there are some things that annoy me, the app isn't perfect, but it is definitely my favorite social media out there, would definitely reccomend, very addicting.",
            5,
            268,
            "21.3.3",
            1632458046000,
            null,
            null
        ],
        [
            "gp:AOqpTOFQTZNnCVXybIwsxW-gbQV2sic-O7R1H5MOmUNlc_tzqh3lc3GOXAxj_oFFWW-lJnRk6u3fmnM_kf0aEw",
            "diane gardner",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgO_5qS0WcfyFwMlAtW9g_c2zp16vb9LS6R-VCBcQ",
            "Love the videos some are funny heartwarming and you can have a good conversation with others on this sight I have shared videos and people love them some videos are awesome cleaning hacks to cute kitten videos I sometimes like abandoned places and hauntings my granddaughter is on this sight and seeing her videos are cute I cannot say anything more then I got hooked on this sight during sick leave and got hooked and still find it funny and uplifting but the political videos can leave but love it.",
            5,
            87,
            "21.2.5",
            1632215010000,
            null,
            null
        ],
        [
            "gp:AOqpTOEGEfr8TL0iKTlpbTDeM8P7HywlMmP9CkHMoaTSd4v4LoElVhIbwqGsXsLdjVB-UAuOAE0Y5GwGk0s2jA",
            "Demi Lovato fan 979 Mckayla",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjdDf68O3jwiDE9oN9_MFuQXghIcn5y5rsFL7adbg",
            "I down loaded app but didnt work . i love this app . but could you maybe fix the bugs and make it easier to load better . like sign in with facebook or google ? works good on my phone tho . ipad does not work fix it please !",
            5,
            89,
            "21.2.5",
            1631995174000,
            null,
            null
        ],
        [
            "gp:AOqpTOG0RETowhjzr4RDqwt5uWU2XkdM9-i9u6giyOq86Lh4A6IY8_wMNpDTBwCg1W3-hAdrV217CmYEZ6ygpg",
            "Lisa Parke",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiVY9QOEX_IzBfdlmb2GOFnoTHSThJ0ucx8c-ChUiU",
            "Love it ...But I think that more is definately needed in regards to locking people and banning them for certain amounts of time. A lot of people who should have a penalty get away with it not sure if its the people with more who follow and have followers and their videos are liked . Also the money side to buy followers and the more you spend the more your videos get shown I really feel that's unfair for people who financially meet that sort of money. It really does seem to happen lisa 🙂🙂🙂",
            5,
            180,
            "21.3.41",
            1633032901000,
            "Hi, if you received a notification from TikTok that your account has been suspended, it means that your account may violate TikTok's Community Guidelines. For more information, please go to: https:\/\/www.tiktok.com\/community-guidelines?lang=en, Thanks, TikTok Team.",
            1633297424000
        ],
        [
            "gp:AOqpTOEL7kemU4O07g1roXIViV1rvcN5eyBVSIs4H8uFo30iC9FhJjW8SSqDrL0rOuzrC3_a1iWUHQv8B3H7lw",
            "daudiniwewe oloimutie",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GimFjblqTgWMFhCwiuOrTmJn84LuiQepOEOL0WkPg",
            "The best ever application in the whole universe, I would recommend all my friends and family to install this application. It's reliable and safe with parental controls.",
            5,
            2,
            "21.5.6",
            1633965922000,
            null,
            null
        ],
        [
            "gp:AOqpTOHKVIWGTQuKH-3ENkQHi2_f-8bcFJu1n2fsAKQW-MTr9MlXda6nHOzVQWlY38x3NyyXVbKps9OPtGOGFA",
            "Billy Potter",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzvpW5Qfm2QLLf0OzH811CyKlxT3Da_LWcmZaZQ=mo",
            "TikTok is a wonderful app. I really enjoy the videos I watch. A lot of them make me laugh so hard I cry, some melt my heart, and some make me mad, but all in all, I laugh. Wonderful app. Glad I have it!😀😀😀😀😀",
            5,
            175,
            "21.2.5",
            1631984012000,
            null,
            null
        ],
        [
            "gp:AOqpTOEK1Cdy_J28S2rMFmiCqOYjaEOa5Z3-ZGWCp33nIfb1Sd2NXCYTZysWC0G7RUmcgiTGi4SHsmOO694OHw",
            "Samatha Bovingdon",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxhjqYDXM6A5IlAvNf69_dp9rY7Xpl7fxQePcsO=mo",
            "Don't know how to make a playlist but I love the app and I love all creators that use the app they can sometimes just turn your day the way it's supposed to be and I am in love with the app it's self, super easy to use and upload videos I love that you can draft videos and make them private or make sure only people that you follow and that they follow you back can see I love TikTok",
            5,
            35,
            "21.3.41",
            1633418630000,
            null,
            null
        ],
        [
            "gp:AOqpTOEN-_RYrq1ur7T40PXZFReFx6hZZuD03xzTgL6D4lYMQyIy7w4QgnHKGpzN-9ApHZ-2xyNkzpms5h5rLA",
            "Gaurika Agrawal",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgubaaGRSlWvdRsY8_vX8Mszug34_4A1y1jiWaP",
            "I really love this app...it helps to kill your time when you're bored...and also you can record your talent and present it infront of everyone...it is also a great app for staying connected to people...I genuinely recommend this app...☺❤",
            5,
            261,
            "21.2.5",
            1632472261000,
            null,
            null
        ],
        [
            "gp:AOqpTOEnaV0GlWXstQzRPyTr3OlPfJg48ht03MBGPCC7b4QAz__hns2F2wEgIuSSpRO3wSnmTacCLUP8XHkb0w",
            "Elysee Quealy",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzDhRw5iRHNc9d2Vg9E0e8NZM2NmCZ2tjAGhKRJ=mo",
            "TikTok is a social media app where you can post anything you desire! Like YouTube, you can see the algorithms and post what people like. If you have an Instagram or YouTube Account, you can have a link for that. Overall, this app has just changed my life. #tiktok #squidgames #anime #likeabakaerenyeager",
            5,
            36,
            "21.3.41",
            1633551520000,
            null,
            null
        ],
        [
            "gp:AOqpTOFBx2VGFA_eoyFS5gONtLrqXVLN7eteAnuBV1FrvM2e_K9F73Vsigd_UtUggctvJPZlpwcXvc4hfpUs2g",
            "Trinity Gray",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyqB-I97mHyBrqwmyFwv4INkB5M_HKl_b3tYpWM=mo",
            "It's a social app. It's for your kids to socialize with people but.... There is sometimes inappropriate things on tik tok. Like slapping you teacher or calling your teacher by his or her first name. But there is some funny vids on there to. I like to watch art,drama,funny animals, and ect. You could watch dance videos and makeup and anything above. I'm 13 years old with a tik tok account. I don't make inappropriate vids or anything. Account on tik tok: trinmix13 or XRandomangoX.",
            5,
            2,
            "21.3.41",
            1633881835000,
            null,
            null
        ],
        [
            "gp:AOqpTOGuu084GiywH1HCfGomO4ybdR6fiqQ-IoE7fWuMmXQu_dBXiijHW-1i3EVXTiz8VQvhWTHzNiK7E6WsJg",
            "Trishana Taylor-Mitchell",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiTWAVPUybtg5zIHRj7CS6qdCOrw13-caFt6Wc1KV8",
            "Great app.. lifts me up when I feel down, give me a good vibes, and I'm glad yo know that there are many people in the world like me. I'm glad I'm not alone, at least not with this app. Keep up the good work!!",
            5,
            0,
            "21.5.6",
            1633987074000,
            null,
            null
        ],
        [
            "gp:AOqpTOFvnSj0nxW9SozCvLYSnqbebC-nuPzDFtyCbqDPfwUSQEepKN51lEesyuJaCmaTmhhTA_Y8fseLKt394g",
            "Radwan Tanbouzeh",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi2xR9tRbSN320zYmxa2wAce69ZTuwGRefwmSXc",
            "It's a very amazing app but... If you can add something new to tik tok all people will love it! It's moving between the videos with fingerprint not your finger. And people can choose what they want from the settings.",
            5,
            38,
            "21.3.41",
            1633347267000,
            null,
            null
        ],
        [
            "gp:AOqpTOEAbH3nFjAWk_44tsqaseFc303QEL7vO06LFcRd8qCY2bv3w77LOGZ_o7IRjCaDiooA2tjRYoIA8QBmrA",
            "Giyoh Frankline",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxW6Qj2P3OqNgnRmKhm3njuSyiukjIG6Uy-2s6H=mo",
            "This is the best platform app at the moment. You can show case your talent, meet friends, business and what have you. With tictok the world is out your disposal.",
            5,
            12,
            "21.3.41",
            1633969124000,
            null,
            null
        ],
        [
            "gp:AOqpTOGTiywt-55UqKZOqeN-qAK5f3Ew6dryGI3XOiwmq82JlgwPTytBTRkbXFTBkk9VKz729xAvV5hUQocC_g",
            "Rick Colon",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJw1OuymRffWngQNwaw5isLHfwjdPqG-M0kctO-m=mo",
            "So much fun thank you, however my yellow line like effect & use are gone, also all effects in my favorite are gone, & can not go to other users page to like an effect to recieve back in my effects list, i am at a lost, please assist & resolve my technical issues, sincerly yours, @2whoami.1",
            5,
            21,
            "21.3.41",
            1633547259000,
            null,
            null
        ],
        [
            "gp:AOqpTOFzq8V5MIPGII9ClhZp6T-cMvNqU0SZ94nQGdIIIIVqGEv2hXjF1NcAEUvohuvcYT7gM90U08BObh--og",
            "Eric Estrada",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwKOTChyQgu6VaDst6Pcnd2kzV8UC6xyZjdn0Xu=mo",
            "I enjoy every skit that is being performed and how people smile amd use this app to connect with one another around the world. Dancing, comedy, family, advertisements, daily acts, outdoor activities. Etc. I downloaded in Agust of 2021 and I do not regret it. Keep it up creators of tik tok. Awesome job",
            5,
            147,
            "21.3.3",
            1632392167000,
            null,
            null
        ],
        [
            "gp:AOqpTOHwqCdDTV82i_f1vRaPlg3f6Rk_78rhu-X4H8K4XFTnofAKm6B8tKDg-5SsKvgYEJWsIt32xMcenzI1WA",
            "Jennifer Nabess",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gg1mLQgpMiFEqktCD4YrzejnfAe49FbZvT-T4sfBNw",
            "I created a video yesterday, saved as draft, sound selection does not show my favorite sounds to add. So upset. I've updated the app. Still no favourites, only boring sounds to add. Will try a restart I guess.",
            5,
            133,
            "21.3.41",
            1633479823000,
            null,
            null
        ],
        [
            "gp:AOqpTOEIlJlsA1bf11JC2FAvfv4WzNjOhsczd-VdbJjTGZ1EmXHbILwi83t18w_V_iKTcmCQDsP-iSc18H0avA",
            "Deepa Ghimire",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwvaOBb5BR0hcHtkGYv6jdCnC4fhGrzD9fV8jd2=mo",
            "Its a great platform to show your talent and get appreaciation ✌✌ But it has been stopped I don't know why, whenever I open it..it says \" unfortunately tiktok has stopped \"",
            5,
            3,
            "21.5.6",
            1633865158000,
            null,
            null
        ],
        [
            "gp:AOqpTOEcW12Wx_dIlj5nVvmseQAMoXOq_NVuAMKloYtqaUz8NVq6KBRfVj68AbG4q3ds54_BRvWs7O2XsUa9Sg",
            "Renaud Margry",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxhBMoKiR-VysSB92a8x8xcf4qCpEX6JRxdiWnL=mo",
            "Having a great time on this, way more fun than the other social media apps. I thought this was only for cringy teenage girls bad dance moves but there is content for all tastes and ages and i learn a lot and laugh a lot. So much that i barely use the other apps anymore",
            5,
            31,
            "21.2.5",
            1632687656000,
            null,
            null
        ],
        [
            "gp:AOqpTOHwothdwuw9TyZO4RXBf3dAC0ulmRND6ex95XzuLHcXTWDf2hTpCXmQjz_gc9_4cpFta2fZk1WdlQlVQA",
            "Bill McCullough",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzPuu-VF_jQb5cUarcH0wVQRr4HylyepyF-wgUj=mo",
            "I love it! It's powerful in the fact that we the people can actually see that there are actually millions of like minded folks despite race, creed, eco status. All the intricate differences we don't control are really irrelevant. The similarities that we choose with our FREEDOMS ARE TRULY WHAT MAKES US GREAT. WE ARE A STRONG AMERICA REGARDLESS OF WHAT MSM PORTRAYS US TO BE.",
            5,
            64,
            "21.2.5",
            1631927612000,
            null,
            null
        ],
        [
            "gp:AOqpTOH5Vnxxp_VqujCBCrYJy0Hy-Ix3YfhTqswo3mbEEmWTeVaHC-XYRtsbElNZm6KCkAogkDAT0gFleu8AuA",
            "Tammy Johnson",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiwVkHmtsS66zmdn937Y70ZQlMq4KbXdhG9KPEEXg",
            "If you need to laugh or want to learn something you never seen or heard before, just be entertained, or get the scoop, TikTok is it.😀 Just try to not let it consume alot of your time , because if you let it, it will.",
            5,
            43,
            "21.3.41",
            1633351708000,
            null,
            null
        ],
        [
            "gp:AOqpTOGAvP2Au1G82RQA5XxmcjxHbJRTnOiYNOCYS4gTWMmusz7y9Le2uEVjcPU1SvlpVN4eho_beZScVrUcJQ",
            "Jan Alnouh",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyaC-fHumDQtH564_0i92JEof5WNPDzfoKvZ3_T=mo",
            "App works fluently, It is addictive a bit, in a bad way, It is useful for some demographics, But avoid corruptive streams. Suggestion: If they were to give the option to remove the random live streams from the main page, it would be more beneficial.",
            5,
            42,
            "21.2.5",
            1632823394000,
            null,
            null
        ],
        [
            "gp:AOqpTOGk519TnwjActP5nFtmwE_Z3ZRAR1Vc4wGliIJMpR1Y97wWcyjjnu7Bmi9KjEwdCJThu6uZmILpi2l2Xw",
            "Turk Playz",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgpoMskF6pGlSvsPZElP2IMytBV2xQLPyu7bQI2RA",
            "Pretty good app a 1 thing i got to suggest it would be nice to make it possible to make group chats so you dont have to click 7 times to send a tik tok to your friends individually and",
            5,
            1,
            "21.5.5",
            1633914577000,
            null,
            null
        ],
        [
            "gp:AOqpTOHrjHvwQAdFKM2MhjNSd-agWBkM_K65ET-0MNIfESspa8X76OKyztI8tC4yXHe9EjLRROEkQkBYSRLVJQ",
            "Jesus Llorens Jr",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj5nUvDeU89U4WQkXwg3HI78u-EHovN4oQvNMINkA",
            "It's a great platform I'm enjoying myself but I don't get too many replies I guess you have to be a member and pay money cash. But I love it a lot of pretty things going on.",
            5,
            0,
            "21.3.41",
            1633948052000,
            null,
            null
        ],
        [
            "gp:AOqpTOEnZ54YcBrNr_ZBU3LINnQA_4usIHWHXKpogp7Lnft6TbrTtdh-FZgCNFmB0Ue27XbNZu2YstXlptpcLw",
            "Zek Myers",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyxS6-9A5k5ElT7lLGaG0BgnM6Z3jpBr9C2KTR2=mo",
            "I'm always getting inspired by this app because I see people Doing a lot of amazing thingsThat inspired me to create and draw their characters over have a there's over have an interesting story and that's why I like this app",
            5,
            2,
            "21.3.41",
            1633871309000,
            null,
            null
        ],
        [
            "gp:AOqpTOHlKB-c02-hjVtXeXkHrIpicwUDUun5Mvp7og_EZTkvdL3eyHSz9IpqV3oBksCYYgEzygS4uYMPd2cyfg",
            "Manaram Praja",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJza-E6Dsgz5GnmQoHstG2S8J4AHsQ_4gC7Xz4ou=mo",
            "I really love this app...it helps to kill your time when you´re bored...and also you can record your talent and present it infront of everyone...it is also a great app for staying connected to people...l genuinely recommend this app...😍❤",
            5,
            151,
            "21.3.4",
            1632825022000,
            null,
            null
        ],
        [
            "gp:AOqpTOFqu31cST71bNQe-JE1kN2bWKAFobPI8oC5YQep99IiTFqEYlNEfoWwoxdQqBwFmalsZVscUJ7d-xAQoA",
            "Patricia Sanchez",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzWKx6lj314qMESTPd-gRUJLWPEpWQacSLDld0I=mo",
            "Amazing! Youd have to literally search the content you do not want,. I see things I enjoy watching and uploaded a few videos of my beardie!!:) 10\/10 recommend for entertainment purposes only* lol",
            5,
            23,
            "21.3.41",
            1633259511000,
            null,
            null
        ],
        [
            "gp:AOqpTOGziZ3sknadZC0GBRG2siVZspOke9PBfji2Jf_swEpnoOOKGzgoFEoNYWk1Mh5an7TnUL07lm4KsWyXqg",
            "Cohen Sutton",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzKfYkqgSyYxv-5tiO3Ald5lTd8IXrg7A7Q2PUm=mo",
            "Really good. Some videos are really old but still a really good app. Has whatever your looking for. I am mountain biker and have gained loads of confidence and new skills by watching tik tok. Big thanks to the creators.",
            5,
            40,
            "21.2.5",
            1632543844000,
            null,
            null
        ],
        [
            "gp:AOqpTOE-F72gnRdtSkAuXUP50ycs0QbbdtN-7jfG6u2Pf42Kqst4K3cNw7IftLycxZ8eTxMAjvGb_9Uexw4Wdw",
            "Traeh Webb",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgA5eHCiFgdTA-4EsyhXtzTVZR4a96Ee78lcD6rFw",
            "It's great. Depending on what u search or are interested in, it changes what they give u on ur fyp. U can post videos, enjoy filters, talk to ppl, follow others, view great videos, and sometimes, they give u pretty funny ads.",
            5,
            1372,
            "21.3.41",
            1633734824000,
            null,
            null
        ],
        [
            "gp:AOqpTOH6YLzLSraL7yaun4u88vEqL6EeKis-G8N_KsQuEx36a_a7qUXdxCIuw_zTbbplZ46X_Rbyt4-QxqTH7Q",
            "Tasker Tasking",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhLwcwwcZCCu6D7oKvh4nG3UiLkOq8JqtmwM_AUyw",
            "Pretty good site It's fun to watch the categories you like especially when there are more millions of great content creators to keep the videos rolling in every second so I'd definitely recommend tiktok if you enjoy short clips maybe of DIY and comedy if that's what you like.",
            5,
            152,
            "21.3.41",
            1633314097000,
            null,
            null
        ],
        [
            "gp:AOqpTOGjF5J2bpJ5OpAJDG9RlCYNs2atnTm0Zr-XVBtvvzJcjrGxf9DGmlr6laCywwfWu2dO9Z5BHAkw-cvy1A",
            "Babita Jackie",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzYCKZCKtx48GlmjfuaGjJ2Bdqt3EKNX33_sIwF=mo",
            "TikTok is so much funny and the same time killing boredom through it's interesting vidios I'm so excited with TikTok as an app because it contains a lot of contents that's to say fashion, hair styling among. I would like my vidios to move 100k and have a big follow thanks alot",
            5,
            1,
            "21.5.6",
            1633964304000,
            null,
            null
        ],
        [
            "gp:AOqpTOGXd2EOD0euMq6PUfoYpI2hHJ31yk8q3uQD39llXbcsAmsFIEmf4JlIitDvGI1vuTAb2jsqHZ_gb5VXMw",
            "cayla Dulaney",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gimu0sdube3ym8w2nvZ2WQbrGU-aw-YJh1UxLENaQ",
            "This is a fun app to be on in your free time. You can meet new people around the world. The only issue is that you need 1k fans to go live that is the only issue 🦋 but I really do recommend this app.",
            5,
            17,
            "21.2.5",
            1633175669000,
            null,
            null
        ],
        [
            "gp:AOqpTOEqJRTyi1_xlGSWt95d1e9sTcaKxgN-3JNWK4C-TfdKyGcdUhVhalkH7h1QYwdB6L-VZoWCHDaBchQvAQ",
            "Ruff Diamond Artists",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GifF-Z2ta3tNdjtjmMZ2Q78TSKIrPvux3fBIag4Pw",
            "Great platform to showcase art and crafts. Lots of silly stuff on there but if you can ignore all that, it's fun and easy to use. I love the way you can add music and effects to your videos.",
            5,
            54,
            "21.2.5",
            1632726345000,
            null,
            null
        ],
        [
            "gp:AOqpTOHKHfKeSTTs0ukMEB5KKIYh3iUIh-4Ocxsq7vZMmyDOxWHzWShF43L8sCXrROm7-UOQTFik7Ou4x_4WBg",
            "Susan L Kulp",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GisQgjZuuxxHd42LQ9HjQrCICyZir2aTWKgtA9Jess",
            "Very entertaining! It is great fun too!!! Once I start watching it is impossible to stop!!! If your having a bad day...q. this app is what you need! It will Fix you right up from the BOOHOO'S😥😭 to the WOOHOO'S! 🤣😂",
            5,
            202,
            "21.3.3",
            1632349780000,
            null,
            null
        ],
        [
            "gp:AOqpTOF4dghhVZXgAhpKXzRxiPDhRyYfSaL67OlbgDGhLOiOoEbEIlxavouMz-jgZYJigJTOSJwzSt6Sx1Cb7Q",
            "Harriet Kansiime",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwIV3xrrCkSxRYJumCas35OUBbOOhTlQUgNy_O8=mo",
            "The best app ever, it gives me opportunity to express myself, It makes me a superstar in own small planet, it allows creativity, it inspires talent, and kills boredom.I love this app to the moon and back , ❤s to the innovators",
            5,
            1,
            "21.3.41",
            1633911823000,
            null,
            null
        ],
        [
            "gp:AOqpTOFl8Ek4l8fl5ssDM3gClivFFCtkhUl8aGYfSuUhPjXf4LCtUIcjSC8rnn8422XzRrfTz3gWOpVMc9bTCg",
            "Owen Montgomery",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwB05j8xyKfNs9P94EMjYUoEeOoB9C_yqaG_Lq5=mo",
            "Based on the fact I don't see myself as photogenic personally, I really enjoy and find happiness and pleasure watching the efforts and talents of others doing their videos. The saying goes everyone in life gets 15 minutes. Of fame. Tic Toc allows people the chance to achieve higher goals then that.",
            5,
            1,
            "21.5.6",
            1633849878000,
            null,
            null
        ],
        [
            "gp:AOqpTOHuYIod6z44VASWXOaFuUCZvw7wm8QMoN0eEBInh6QPXesZW6VPb52a0jAK3n8qPz-WMNzQ4DsqxDOraA",
            "Keighra Myers",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gifspkj0P4PvxxuQWtPWMuBkwTpfvs9PER0x9cjAA",
            "This app is the best! It has such cute dances and cute filter's!! You can follow anybody you want. And if your friends have the app if they follow you and you follow them you can text each other! Plus it's completely free! Best app ever highly recommend!",
            5,
            27,
            "21.2.5",
            1632315771000,
            null,
            null
        ],
        [
            "gp:AOqpTOEv5DMq6C4kUnXAMm_--AzCCmopEl4Aqn-R56h4anOA4SNZzt8HTb6ovdmmCl1QyIDnFhX-mYgKR27uqQ",
            "Gallo",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhOeU4Nq5ySgfimNSy9DXsm_iRF3qZuQgsl7xvoGA",
            "It is a great app for people to get to make vids talk to friends and get to see new videos how to do stuff or to try and I really like the app but sometimes I don't cuz ONE time I got hacked and a new update came to my thing so it was bad but I hope I can get that fix ummm yea that it so I hope others like the app and everyone just has a good time and have fun make videos and yea",
            5,
            47,
            "21.2.5",
            1631901174000,
            null,
            null
        ],
        [
            "gp:AOqpTOE3UJJBhCvavkjHNpCfQhIZDDwVAHudCtfME9mhqdr8MLenDiiZLYoeUrG0WgNJI9X4NRaqvEluXf7hKA",
            "Nicole Rogers",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJw1AX1NOSZNU7Ru9ioXGxdzXIUWFHUAhSonnGmo=mo",
            "I absolutely like the variation of topics that are on your site. It's the freedom to post whatever you want even if other people don't like it. They are free to scroll down and if it's that bad then tiki tok will remove it. 💕💕",
            5,
            54,
            "21.5.3",
            1633363253000,
            null,
            null
        ],
        [
            "gp:AOqpTOG6gn5frV5UVyxNRGKmeP9ILAfqaWGITCRFWBjcSanYubJp1xJ_uFQanMTr2hkiq9Ur3tdvZEuG-ouOaw",
            "Mahado Abdi",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj0P8W463mFbexd3Lj9kZcERR1uFy33CtvDjotkfi8",
            "I like this app, because it has a lot of optional like, information on how to improve your business and playing games with each other, but you will lose a lot of time ⏲ it.",
            5,
            7,
            "21.3.4",
            1633016304000,
            null,
            null
        ],
        [
            "gp:AOqpTOGZBDl9dpghmb43Mx1tnlWCOjNXyuVn5Mxf49cqr652RqH5RztxR73qWGMIs7Dqqh2eCcIaLUlJwTehuw",
            "Stephen McWilliams",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjX0zeMGgcgCc16xmBxQOzQKs2XWwUy3j1GE-o7oQ",
            "IT A GREAT APP AND FUN TO USE! HOWEVER ARBITRARY ALGORITHMS BLOCKING \/ BANNING \/ TAKEDOWNS ETC Alleged Reports the Reporter must be able to back their Report with Evidence or Evidence must be acquired before ACTION!!! ..EVIDENCE IS REQUIRED BEFORE UNCORROBORATED REPORT[S] wreck A Persons Rep \/ Account! -If IS INCLUSIVE ENVIRONMENT THEN PROVE IT ..NEEDS FAR BETTER CUSTOMER SERVICE ONLINE AND PHONE U KNOW PHONE These apps are great but these but where invented for people to Talk to each other.",
            5,
            54,
            "21.2.5",
            1632022483000,
            null,
            null
        ],
        [
            "gp:AOqpTOFcPK2TQFjVU0pwPQQ3QlRdXM60krldF4DHIS1NxJSD2uDdII91W4OLASttXKW6uSL_dywuAT53DVt9_A",
            "Zandre Olyn",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhhLjy2qH1PN4LrxG8cIDQ0bKZy_rBeAgVGxd6lzQ",
            "Ecstatic, Extremely and Extravagantly a very GREAT app to just showcase your talent and be yourself, I never had problems with it. I love it because in due time the world at large would know that I can sing, dance and even rap....Thank you TikTok creaters.",
            5,
            212,
            "21.3.41",
            1633135674000,
            null,
            null
        ],
        [
            "gp:AOqpTOHSh9qJb050VzY4iWrG_rGkLYtClRGr2ALXSIcmNZhPG2cx5-hcRbPS894LIpA-8c-UbG-J2ygYre8QRg",
            "Jody Michael Bennett",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhpAi5Gy0a6YtlQedtW7-8TETAz2fn5FTX0XM0vpQ",
            "This App is amazing and addictive,must say thank you very much for creating this app,I'm only struggling when I go live,it keeps on losing connection therefore my live laggs a lot,please assist me with a better connection. Thanks",
            5,
            81,
            "21.3.41",
            1633281113000,
            null,
            null
        ],
        [
            "gp:AOqpTOEg7Isy1uT3hJXPpbEOuvwHr3WB9CySjIzFb574CNt2ij5qA-f-G2UyMk2fZfnkhLMzOiqOjFh4b396QQ",
            "Keanu Fido",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzPctZe2Pd5lf5Fg5R0IDfueDBJwefbCsdR57u6Wg=mo",
            "I rate five stars because the app is good to find and meet new people and as well as the fact that it's easy to post and edit videos as well. I've had no problems so far",
            5,
            6,
            "21.3.41",
            1633721477000,
            null,
            null
        ],
        [
            "gp:AOqpTOEJKSFiU1zL7BQZSD0OKC-BQJ3IiH-eg3qcvUPz0NEHA9dDPVmEqyj5O1DI33PAIRYdjhz6NuY569DyEA",
            "Mint Julip",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiTdLpyO-TniC0YNIEg117rpMXqYRUenyWh9Wofug",
            "It's a great app. Around the clock there's always something on entertaining. I only wish for TikTok not to allow trolls to do as they please when reported. It should be a violation for a troll to be hateful, racist, anti-LGBQ and told no violation has been made. Thank you.",
            5,
            31,
            "21.5.4",
            1633695735000,
            "Hi, thanks for your valuable feedback. We listen to and value your opinions and suggestions. If you find any inappropriate content, please report it within the app. We will review the content and take actions immediately to promote a safe and positive environment for all our users. Best regards, TikTok Team.",
            1633833470000
        ],
        [
            "gp:AOqpTOGpOhQ2fxSbGvGWp6wykBpyDAACkrpb7VZWdB-lJYyp6ZnOw3iafrw2fOWNUeURlLnsUFHVNHsRQi0Gxg",
            "Fahim Hameed",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjidgeWg6y0m_gKneoe30-3XpuDo-UTvapvGfjBtg",
            "The best app , gives you the freedom to choose what you wanna watch & as long as it is good fun, postive messages it can really help you to block your negative mind,.I like it alot, but some techs are a bit hard to navigate through . I have a problem of removing a sound, any advice will be much appreciated",
            5,
            23,
            "21.5.6",
            1633853314000,
            null,
            null
        ],
        [
            "gp:AOqpTOGp0jZfulQ2Lu3qoJCd6U07lXaC1ZdSlDVGjsAs6qHknzg78FwC4uyO3TUwcJIhinFM8R_AtaxBM30lhw",
            "Briar Smells",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgVEcLmqna_2uVzc84Fdpqmr4khrY7M-_UOLGyc9w",
            "I've used this app since 2017 and it's just perfect, but please be careful while using this app as the videos there are so good you'll be watching them for... hours!! 😅",
            5,
            3,
            "21.3.41",
            1633967585000,
            null,
            null
        ],
        [
            "gp:AOqpTOHyu_d4uKqA6MCkRfKhmEZ7LapZkz-qiSasep6x3z3wv6qAFVQQl6C4detyfbIXtQOVwP3S3s1cLvME1w",
            "Luna Wolfy!",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgXoDyGQI1rn7SCz1PfOjAFEfPr0Kreu_BxAXg8",
            "It's pretty Good app! I even started an account that went viral! I did not expect it. No problems with Tiktok at all but I made a video about something and tiktok deleted because they didn't like what I said and what I said was not bad, Tiktok doesn't know me so please don't delete any video of mine",
            5,
            123,
            "21.3.41",
            1633029670000,
            "Hi, sorry for the unpleasant experience. If your video contains inappropriate content or violates our community regulation as specified in FAQ https:\/\/www.tiktok.com\/community-guidelines?lang=en, this video will be removed. We hope to see more good content from you! Thanks, TikTok Team.",
            1633297872000
        ],
        [
            "gp:AOqpTOFIe5gmAErwHzTjsDvmIS17PgRTRSWoxal3hfWav0EZFPPXNsNiGUwiaDrGVu0A6OgCpuO4P0CF5CCuCg",
            "Lissie Narain",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhG-HfAfTiCMmUhecsG8x_BtAFy3ISHrxtPyi1MDw",
            "Amazing app, i've been using since 2019. I recommend watching the amazing edit's people create! but they get hate, But when you make one of those edits you will get lots of followers, likes, and views and more!!",
            5,
            93,
            "21.3.4",
            1632609782000,
            null,
            null
        ],
        [
            "gp:AOqpTOG8GfvdQTEOFg09PHSCt208676UHLFPzwJgcuoEQusc1_lqCe1tm4qd1PwIdQ4POw3d2RRWPjbAxzZKoA",
            "Nikki Peppers",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJw38a3_tWSkiXvCiO5b1lZgyrNtAEAKZIizyx4T=mo",
            "It's just got so much. Comedy, arts and crafts, information on many things, makeup, true crime stories and etc. Keeping me entertained for way too many hours. Love it",
            5,
            108,
            "21.2.4",
            1631786239000,
            null,
            null
        ],
        [
            "gp:AOqpTOGVW0Cit-Ss1eNrpgNeJEt-hmCAPyioI-DQAHkixj5-A5LUexuH2-UOTFSyhqPj7RnCq9kCi0bzEkL9MQ",
            "Amanda Taylor",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjcBghynCAyBJVd-t4-90_ejIbQstLgI3fyc5Y",
            "I kind of wish that when you visit someone and they have so many videos that instead of having to scroll with your finger to get to their first video that there could be an up and down arrow where you can automatically go to their first video but all in all I like the app 👍",
            5,
            23,
            "21.2.5",
            1632471411000,
            null,
            null
        ],
        [
            "gp:AOqpTOH-krjuu2fGkXe8iy1Rj7_aiCqAaSbIH3MC-KpyenbAwmENDk9dh7DMqX312RnbY4A5dv8J2wgwF0BUTw",
            "Galaxy Gurlll",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiSav82QpS-JhAWzd2gsdPW4tPEY8D80sPuwP2f0A",
            "This app is a way to communicate with people and it's where you can be yourself and make fun crazy funny gospel spreading updated things and you do fun trends but sometimes they're not all safe some trends are bad and I have been seeing bad trends on the internet but not the actual video of people doing those bad trends I just see and hear these videos on the internet",
            5,
            35,
            "21.2.5",
            1631888932000,
            null,
            null
        ],
        [
            "gp:AOqpTOFmQTaioHoGdey_1TO99LyyqCilf5Zw-lwVTW-rwiYaQS2ylSkHcrZIU8SMShr300RzoTIV35MRgWsEKA",
            "Thomas McPherson",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJz6gdf-lhOBRlsvJqBJkBW47wwyM3cqpCsBUUnL=mo",
            "It's a awesome app I've been watching it for a long time and I'm going to addicted to tiktok and I like doing videos on it and I like getting followers and you can get new friends and this is why I give it a 5 star",
            5,
            6,
            "21.3.41",
            1633554431000,
            null,
            null
        ],
        [
            "gp:AOqpTOGwJmVgj7NhguBJUoZJW0gfXYRK1_NQHNMUtK1ARLyL1M-_8MgWr3nhZoC3Zgp91vou6v8qrWfxfZhDsw",
            "TheFormlessBlob",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GihKUbzOhgAPjhvpS0TUD0DdDoX62bjbVYCReCHUg",
            "It works pretty well except for the past week my DMs have been broken. I get the push notifications but they don't show up in the app even when I've refreshed and updated. Update: Everything is now working smoothly 👍",
            5,
            35,
            "21.3.2",
            1632384006000,
            "Hi, sorry for the inconvenience. This issue has now been fixed by our product team. If the problem persists, please don't hesitate to contact us within the TikTok app via the following steps: 1) Go to your \"Profile\" page 2) Tap on the button on the top right corner 3) Choose \"Report a problem\" on the \"Settings and privacy\" page. Thanks, TikTok team",
            1632349595000
        ],
        [
            "gp:AOqpTOGUfgJxhUlV2S0JBB2tEDXGLjGiN5U4Qt-QE6cd3wtT3A-prHXxjqrG8Qt1f09CXG38dhVkoG2fihi31w",
            "Melody Haldeman",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjmHjMRwMnoL4IOE7JRZpcyjLm3FFiRvuwmiZ7EUw",
            "This tiktok app is really fun to watch videos on and records fun tiktok videos and really I just love it so much it's like oh my holy heck God so yeah I really do like this app so much I tried downloading at 9 years old but it wouldn't let me but now that I'm 10 I think it will let me download it so yeah my real name is Bailee haldeman and not Melody hallman so ignore that my real name is Bailey hallman I'm 10 years old and I like anime and other stuff especially tiktok and YouTube and just like",
            5,
            1,
            "21.3.41",
            1633980510000,
            null,
            null
        ],
        [
            "gp:AOqpTOGPQXoRJBGjXPhABdjDFCWpRCFbEvWKP6_U3_HZ1RsSxqP1j2ca1PcREhiazUU4Vs-floMBKR4Db7WEzw",
            "Tinystar34",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgYAJZz4A1eDNjeXr5YFqphIdnEszYS_CUGQV-Bzw",
            "Love this app, I'm able to express who I am, this is great entertainment when in the house or wherever. Doesn't cost anything to be u.",
            5,
            2,
            "21.3.41",
            1633859837000,
            null,
            null
        ],
        [
            "gp:AOqpTOH7Jw9DMgqpqB6quDo_JX4vQCSZFCHVIsseiEo50hQuGkYT3usrCV0_TQ4jG8IBWjGeiBgwB-aUAkF8QA",
            "Tolex Elijah",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgOegsOxLsCh1oBujG-Nfd2VS_5GJewLjeLbtxHNg",
            "Does what it says on the tin. Only downside is it's not well age regulated due to the contents which are clearly very interesting for adults, but in a way can be slightly worrying because vast majority of its audience are underaged. Hope they come to this before it's too late. All in all always puts me in a good mood with the limitless amount of comedy lol",
            5,
            57,
            "21.5.3",
            1633249288000,
            null,
            null
        ],
        [
            "gp:AOqpTOFG5LtWXQFJHNf6Emdkw9Z3q1uB26j7RDUe9MPLvGPR12IPTBkBIAmMFnF2LgXDuW0zM1TubxJOEo2SAQ",
            "Linda Fitzgerald",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhYCvy71XLGa_bVXAhJx-_4gn7fgkJjwcDOwC5GYQ",
            "Love the videos and enjoy the stories that are shared also the different emotions that are felt, it is good to know that there is a platform for everyone and their stories can be told, shared and heard.",
            5,
            19,
            "21.2.5",
            1632538760000,
            null,
            null
        ],
        [
            "gp:AOqpTOE5pirW5FVyopaTaTYYwQiaEgLQK5dCTsgUN4yrK658Pq0tHi0PgZkRT5hA0shH19-qbZFKe7NYhdBb9w",
            "Daniel Hale",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gh4PoAVu4ScXFrUOHSjHtqdOpzDy17k3qpmnDUxXvM",
            "It's what it claims to be. I wish more features were more broadly distributed (I have 30K followers but still can't use playlists) but that's minor details for sure.",
            5,
            9,
            "21.2.5",
            1632688844000,
            null,
            null
        ],
        [
            "gp:AOqpTOGj-7-iVzed5hlqefsIfdKnLONDxpB5b6xCtCSR8wpYJd6YUqOVEgEFOnK6a8PJOMtvnzbjvOyDlEMPCA",
            "Walls WontFall",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgCOTPO0ZrSU9vyS3zx1VLHVFy_HZSjzpYJco2N5Q",
            "I love Tik Tok, if you have anything you are interested or want to do Tik Tok is a great place to express it and if you are just looking to watch things based on what you like it's also the one stop shop for everything interesting.",
            5,
            27,
            "21.2.5",
            1632333506000,
            null,
            null
        ],
        [
            "gp:AOqpTOH9T_OygNepOd_HoGaL3tr5a5YPmJuIV73lemgMnOi8EtvZ5Xh2Z6cYCOGNnVZHfp3iLH3V5BH0R6irWw",
            "Jay Burns",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyemX6AoqAa2S-A92JThYvpjmf0raRSz6o25bkn=mo",
            "A very educational and fun app. I've met alot of very good people who want their voices to be heard. Lots of ways to make videos and plenty of entertainment for you.",
            5,
            45,
            "21.2.5",
            1632057047000,
            null,
            null
        ],
        [
            "gp:AOqpTOEz6HoJSqqFmorZTDcH3NXnjuAIs89A8M-QQCDcw7fCMFhJD2NBSC5Dd3Cuyc8GkaO35pGI2FHbUtj3IQ",
            "Karen Morgan",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gh6gZ1ud0yw3-hsEfgpmGIhV_f1DtVVKfz0ZI4xoQ",
            "This app is awesome. The only problem is if I try to log in with my chrome book it says to many attempts. I don't get it. Please just fix your app",
            5,
            43,
            "21.3.4",
            1632737942000,
            null,
            null
        ],
        [
            "gp:AOqpTOFm1m6pu0ta25OegxV5UHBcWVCixsaRbFdnhSWNC3321DVXQnzznHUU-HDo14gAG6uk8UQYiHcW36andA",
            "Am p",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwsoIOym3ah16eMFwMo5k1xgcqbAmarQPIhHIHy=mo",
            "It's cool. Takes a bit of learning to use all the features but not bad. The ads... I guess. I'm glad now you don't accidentally lose as many tt.",
            5,
            4,
            "21.2.5",
            1632539026000,
            null,
            null
        ],
        [
            "gp:AOqpTOHfjm3F5PWl44IhTi0qcipyDFbO51YApalAcxjmribcu9nHEwjMVMgTZUZv7JDtWB2bgtAdNrquIuhmbQ",
            "Ashley Stockton",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgPsEJZ-3hGKGKx2yeHi3R7wxmk8jkCr3BZKdmd_w",
            "Promotions only go to an audience that won't give you increased following but single view profiles that are not related to your content. So they meet the requirements they promised but you don't get any added benefits.",
            5,
            2,
            "21.5.5",
            1633904858000,
            null,
            null
        ],
        [
            "gp:AOqpTOEvk0erCCyY9hyQ15zAba8-xQK59P5xfQ1_NP_2yngyTr6LCme1nPDbce7lDXNoeGT3bVEos76zUVEl0g",
            "Jake Prior",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJw5RahHB_v1ujw7IAP3epnjmZQHvD_lL-cOo_pI=mo",
            "Good to wach stuff like gaming clips funny clips and more .one thing which I don't like is the ads you will all of a sudden an add will pop up when your scrolling .",
            5,
            8,
            "21.3.41",
            1633240661000,
            null,
            null
        ],
        [
            "gp:AOqpTOEWoUSrhL2kkCdZK02f41Wn2lc_5G1NGtG2jATWYI6wbpdXPpwmtLoIEO8vd07G25l4ZpD6_mXHaG7kzA",
            "Ayabulela Nqolwana",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiAlCs-GcWL3og7UAE2VUD6Rx7bdAWV7mbk2sg9",
            "Tik tok is the best app know to man kind but the one problem for me is that whenever I trie to watch people live it takes forever then when its done the person's live is already finished please can fix that one problem",
            5,
            1,
            "21.5.6",
            1633950023000,
            null,
            null
        ],
        [
            "gp:AOqpTOHzQ3YEqIjGr-oB03bduaaZFakWkZmOgjUX0KbLb08XUlf4uc6iBqwKme5Spu1UX2B2lkJ8zmU0gtfkMQ",
            "pervaiz ali",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxLAkxMOTpoBKvw4ItijDz4rLk-didwi62-M0U=mo",
            "Lts a really good app i love it l wish you could edit your videos after you posted them tho that way if you messed up or wanted to add a caption that you forgot ad you don't have to delete a video that took forever and do it over again if you can make this possible it would probably be favorite app",
            5,
            63,
            "21.2.5",
            1632639222000,
            null,
            null
        ],
        [
            "gp:AOqpTOH15BP_rtlPt0hc1eyowJ8vz-p8-losAlFnqCznxlal7UeZjwydLiRYW5VCpTiDhR9xhOtaatqrUfePNg",
            "Catherine Andres",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gg8VypBFJhoygQDRZAeC2-fpwREuQm11dHwChvd2Uc",
            "Excellent for switching to your own frequency. Whether it is music, animals, or people. Constantly looking for positive things to share.",
            5,
            22,
            "21.3.3",
            1632640146000,
            null,
            null
        ],
        [
            "gp:AOqpTOFZ0CbFPsIQhcz8a8aQR-MyBCJns-zG0egfJJusCNtJNUyyifROclkJubFfbPDHM7h5oShxp3uO2Mhg2Q",
            "Cucu Roberta",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxhrse0vSKqYbrr2_LQ05Nm_jgBsPI3kT284U0k=mo",
            "I can't get back into my account, because it keeps saying \"server error\" I home this is only because you guys are updating the app,but if not please fix this!!!",
            5,
            18,
            "21.3.4",
            1632644416000,
            null,
            null
        ],
        [
            "gp:AOqpTOFlUxeEJKl4QeZ-jEb9XKu9aKi_SfNmhrOTye2mmVaBMUMHmKBeWzEDjQcngRJ_OqKx3v0i4e6SuR76Fw",
            "Megan Snow",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxakni08-JT_7KeokqWSuPPvFI_ladRv4JvKuPb=mo",
            "It's really fun, and see lots of funny stuff it will make you laugh really hard and even make you cry but it's great. Still learning how to use the app . I really like it so far",
            5,
            37,
            "21.3.41",
            1633142753000,
            null,
            null
        ],
        [
            "gp:AOqpTOGMeO9Ix3iIKKuPfPH6FrSssyq1b5ZquF19G9J_sOTSDQSKzHRC1PemCKeTqF2eT-CoQFie2BxbAqhKiQ",
            "mike jacobs",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjLJZExg1xNVYEixFXFhc3UAZ1LBXOcfg54CGW0",
            "I like this app download videos is fast but it doesn't do most save videos don't why??. But is fast might do latest save videos I think is better than YouTube plus do duets🤩",
            5,
            2,
            "21.3.41",
            1633642219000,
            null,
            null
        ],
        [
            "gp:AOqpTOEaARhzryfEaGmrS9WO-Yp5b9yZjYXrgbZtYgxAxKx3NgSevwMqRoYCI4_6kNwtA-nXRJRZA0Zmap9iSg",
            "that's a quirkygirl",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgslHGDJP3y0c44SQPHBzDYPd-ttvc3TKO1vm28lA",
            "This is such a nice app and so many ways to sport your favourite creature, and it's a good way to take time.",
            5,
            0,
            "21.5.6",
            1634002260000,
            null,
            null
        ],
        [
            "gp:AOqpTOFNKjcJjTKBAXJlS_YrsM7zlsXqz9F_RP1oMeXQZ_QVSq_8kWhE7k3o8-HOnggTbZh83efCaxskWhy49Q",
            "Darrell & Micca Company",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhmtNr576A0XNSV9ihxClD6Vl2Jtp3canJY3DlycKI",
            "I really appreciate this app it brings people together and it really doesn't have any restrictions red tape of your own talent you can just almost anything. But keep in mind you .",
            5,
            27,
            "21.3.4",
            1632841751000,
            null,
            null
        ],
        [
            "gp:AOqpTOEa7uiCQ9hVYMmS6_3ohqHNCGcH3885YbYZfC3Ix49NigvcTe7AeHR-qNwDH_x7B6TLYMUhnek_0_OAog",
            "Paige Mcdonnell",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzAWWAY2uEzemY95KfRUCpScRsJLryIlQEOcnF6=mo",
            "I like the app because you can meet alot of cool people and people with awesome stories to tell. I also like that you can actually make friends on an app without having to be worried about their age Thanks for creating such an awesome app😁",
            5,
            5,
            "21.3.41",
            1633435476000,
            null,
            null
        ],
        [
            "gp:AOqpTOHP98t8WpywjlLr6hzCLrnM5Hw5EJLYv_NSwE9GhF7hePaMI-An8W-fJvrZJ-bjagAGQLX6LWLdE9U-ZQ",
            "Ali Ameer",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJye_I5jexGo-tEcTg42jcmc0_ykVO_itP8P8X0g=mo",
            "My wifi is great and all my other apps work great.. except tik tok .. this problem happens constantly somtime i uninstall the whole app and download it again and nothing happens.. it tooks days and days to be reconnected",
            5,
            26,
            "21.2.5",
            1632050258000,
            null,
            null
        ],
        [
            "gp:AOqpTOHyEP4GrxBCwCsR9MpZKKDw8TA-BVUoqX9f1hxM9PKqNwBQ6YCLRo17wgjfpfcI5MqzGTxVkEiIaEdTHg",
            "Wairua Wairua rask",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiX5TcEmRb5yjmrEkqxsH4vTHN0VhR-J3SDjnhS",
            "The reason because I put a 5 star review on it , it's because when I try to play it or try to open it just says unfortunately Tiktok stopped working all the time so I kinda need help getting back on because it's my favourite social media game but it's not working:((((.",
            5,
            25,
            "21.2.5",
            1632455325000,
            null,
            null
        ],
        [
            "gp:AOqpTOHQlY8E3H5Yz90hvMEeQIuyQBJunMEckCc2Xu0jgef3_2eNVLfYZmFTrjDK_xzsGLpZDfPiY-UkMst6iw",
            "CrocsKat",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjSSPN3zsiTCssD-rLHSr4WcNJwCBQittpUYnYrIA",
            "really good app for time consuming. you need to feed the algorithm your preferences first after that you are good to goo",
            5,
            1,
            "21.5.6",
            1633919999000,
            null,
            null
        ],
        [
            "gp:AOqpTOE-ArDnFv5Ced0hERup8FJ8tMfqv9s4XqvYN0BT7lWCUVAhvcgvr6-l4S3IGZD_1NOq6WtctNXuSr8jXQ",
            "Emma B",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJy9L6rY2E0bug-d6oY-ncoalwlaK7norET2mr1k-g=mo",
            "THIS IS ADDICTIVE. there is no app like this that can addict you more. I love it so much. There is so many things to watch and I love it so much. I can't even explain it but you need to get it!",
            5,
            14,
            "21.2.5",
            1632966920000,
            null,
            null
        ],
        [
            "gp:AOqpTOFbSmMPx408Yu6sjQq2hqnAmYUqnERCIR9hD7wcwhIGOEWIq4roPyiHgnyRdzffuO6EswPUYmGD7KcVNA",
            "Joe Coop'da'ville",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgECYU_LjPU4lEkPwqi1buAnj7OSi6h1R9j2Zug0w",
            "The app is awesome! Allowing a way for this unique platform to acknowledge a diverse world of amazing people. Good food, music, laughter, etc... you name it... Unlimited catogories shuffled automatically.",
            5,
            23,
            "21.3.4",
            1632929927000,
            null,
            null
        ],
        [
            "gp:AOqpTOGBkkRfpUU938pr2_ZhTi4alIe1mUMPp2taR9NfuH2yEcUj2PiY4oJtmx2WywSyh2Z3dwfcWMdGcj-EmQ",
            "Ayana Moore",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Ggz8LpIYbNpUS40SoySI9s6XugHaNx_JNmLdPKOdw",
            "More than great it's, amazing. Also it will always help me laugh and you will always love it forever. mostly it's very good and teachers are there and kids and adults😪",
            5,
            12,
            "21.3.2",
            1633111622000,
            null,
            null
        ],
        [
            "gp:AOqpTOE3bmoqXPOUBja9bQTSc1_ipXstCTuhbjeK6RWR7iEcIWR-zz8cuWB7n0CvzAcaPon5MpZQaTyoR23alA",
            "Richard Gori",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyWBl7Tq42Nz634IYSGwmD3hXQZJ68lFDPitIyq=mo",
            "Well I am a 71 year old woman and not very savvy but our daughter sent me a couple of clips from Tic TOC and so I joined and let me say it was my best decision in a long time. Now I can laugh, cry, agree, disagree and voice an opinion all free of charge. Sometimes I even share clips with my husband who as a rule does not care for Apps..",
            5,
            18,
            "21.2.5",
            1631922123000,
            null,
            null
        ],
        [
            "gp:AOqpTOHNx8VUOmU4cW8Wc85zGGznehshrTLDa9G7VxmzC0GG8e06zfyoSN7nkPYz-81ay0AQVENA67JCzPC8AA",
            "Katende Nickson",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhrWIw8DNTx7nrb1i1FFKIyIq0T62Ac3XEMS7nocQ",
            "Greatest and easy to use. No adds, nice videos editing, funny effects, TikTok is stress killer. Easy to share videos on whatsapp. To me you diserve a 5 star",
            5,
            1,
            "21.3.41",
            1633889991000,
            null,
            null
        ],
        [
            "gp:AOqpTOGhE0xdv5Ral7yjil0b80149i_Fwp6mPGa6Qk-nFPRq6wrWreyvaGwogWYpvX9qh8IMlSJ1I5XFvrza4A",
            "Micheal Shelton",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj8M6AgF5rJizalwxdI5rZ72i4T7qwKzE1gpg0_Ow",
            "I love watching lives and buying and sending gifts to hype people up. This app is a great time killer and way to meet some pretty cool people and learn new things and have a good laugh. You can even get really butt hurt I love it 😀 😭 ♥",
            5,
            0,
            "21.3.41",
            1633866644000,
            null,
            null
        ],
        [
            "gp:AOqpTOGVpHQLK3MWpI3pQm0u58LFFpJtQ5zQGkvMoi8lXxLc1a7t5bxlKI5HfdzYE_xU3kFdyNj9K0kGKTqVNA",
            "Brian Walton",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhQNw7k0fhAvbRP5rMqfZz3An9ebyKz18IIg-cB",
            "Super good stuff and lots of information to be had on TikTok. You can obviously see the content isn't biased to any one agenda and is less robotic than any other platform online.",
            5,
            18,
            "21.3.2",
            1632871932000,
            null,
            null
        ],
        [
            "gp:AOqpTOENlfhc5ajbUZILRmFNNfRiWg4PD4T6ttWJz8N9K8l4r36kCpSnNbDcocU_DKt3JhPmXtmJjdH-YtwE5A",
            "Orupah Kushaba",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gjaw30W2yWWVnno_udMowb_1jfP2RvSVTG3yAWQ-A",
            "What a great app,it has all fun that I can't explain.videos that makes my day, It's the app that takes my stress,it's one of my favourites",
            5,
            0,
            "21.3.41",
            1633958363000,
            null,
            null
        ],
        [
            "gp:AOqpTOHRlnp_LKiUuI3XYDJhJ6qZmzV2YJfR7HwJ2GiJrwFKykazrMGrUne6LYMRMleD7JYccQvyiEQtVMLVOg",
            "Fred Flintstone",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyn1LKGhtQ96CZ0SS1VmhcKJzh_WpD3696OoTu9=mo",
            "It is very entertaining, you can watch it when you get bored or create videos. It's just really fun, there are so many genres you can watch on tik tok",
            5,
            6,
            "21.3.41",
            1633543887000,
            null,
            null
        ],
        [
            "gp:AOqpTOG_2Cen6fX_sOvymBTmAQq-LmmJDb41N3U8hSS11C0x4O3mxfsmutgTXZHdKUIZpUyiUA5SL_meXAUTGQ",
            "Kritika Ojha Vlogs",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj2sjv8GhznIdRy2iXJq5RWJWYRPO9M63-F8OnC3w",
            "This app is just amazing for entertainment but there is one problem. While shooting video it's camera setting is not good and yes, all the things are good expect camera setting in this Samsung Galaxy",
            5,
            100,
            "21.3.3",
            1632542270000,
            null,
            null
        ],
        [
            "gp:AOqpTOELb5VaFsUqAUwM-JByyXFCY-czzYYedC219PrZdo1HZPmn4UaXRaxY1STYAC2SM3t7Uo-CSWeU1gch7g",
            "Latina Gemi",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhkP4xtDIac316fah3RabSpPTbsABbgmRjRWoUEZfg",
            "I absolutely love it. It has old and new songs and though can use it has ringtones, alarm and notifications plus it's free. I'm Enjoying the app... Thank you, LatinaGemi",
            5,
            71,
            "21.2.5",
            1631800676000,
            null,
            null
        ],
        [
            "gp:AOqpTOFntF51l0MZS3L8EEnC7cJcBJBTIfbQZnV1FWw8pXJCbCUbH7k0YOsXCkFExcPbuW1AbTyEfxCiHmB2BQ",
            "buttadawg",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GipojTj0d8x8c7XW6MQz1Lvocgq040u8DwwvxzH2Q",
            "I love the app because I can try different effects and I can pick which effect I want to use. This was a great experience for me!!",
            5,
            37,
            "21.3.41",
            1633113385000,
            null,
            null
        ],
        [
            "gp:AOqpTOGVR9clAKzhDVlBGBgygLKGsBQIy2cQu49bY9JKLg0wKj3jLQoI9kXbS9aOra1Nr3kAD6koZcVSClGtHQ",
            "Imogen Parrott",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzoD57q5i-clYHQlAd1MU8gL_6wrLgkVKmQA46S=mo",
            "Love the app! You can express yourself in many ways and there is no need to hide! Super cool 100% would recommend.",
            5,
            0,
            "21.3.41",
            1633995324000,
            null,
            null
        ],
        [
            "gp:AOqpTOETa0mDfspC0FRlTZUZKVcZcgmfBEqp5hhLHcjq_YHNQoTW8BmLDHJWWBgfeyk0s6wEM0jJ0RkaOa9Rug",
            "Allen Fitzpatrick",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJylrzSEbJS8J8MJR_67fuAsADFnXiJrXHXW-xh5=mo",
            "I really like the app it dose noti take up any space for me but I have an Android and it won't ,let me sreach videos and it won't let's me change my profile picture but othere then that this app is perfect even a little more better then youtube great work ticktok!",
            5,
            30,
            "21.3.41",
            1633288223000,
            null,
            null
        ],
        [
            "gp:AOqpTOGx6BIW7HE5ACB5kU2RZTT3s4TuE7IEEv3MT9vkPFVohe_Jlmz0FYH49nYkqCVyU8bjo92tT-ZFb9lQnQ",
            "Kasun Navindu",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgWaJbjTi8xCawW5PqKQ3OqnIpmlzr7BKbmH4jd",
            "A really good app that gives me a good opportunity to learn about things I do not know, to have fun in my spare time, to take our talents to the international arena. I love Tik Tok forever.😘❤️",
            5,
            114,
            "21.3.4",
            1632578452000,
            null,
            null
        ],
        [
            "gp:AOqpTOErJ57X4YEpCsudQviBEVaxZVJ1H-5IOIB3fcxfKgNucPFt9advIOpye5pyH-z7ZJb5D3XVKLyLfON3QA",
            "ROBERT KIMBALL",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzFbVN5YeOwDZAYQpmgK-O6vqTe7flVx2JUs8E0=mo",
            "Informative videos new ideas and easier ways to do most everything special site i dont really care for the compliment searching ladies or guys but overall good knowledge is a better forum.",
            5,
            8,
            "21.2.5",
            1632865522000,
            null,
            null
        ],
        [
            "gp:AOqpTOHOXmx60j6isw32gX4IY6Uv_aDOTOWSIE9z7YfZTOeHhJ9X6PpOeH0i-Wd_6G5yLBBfK9UIsXmTK86zPg",
            "xoxStarlightFirexox",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj1Lu1Vb9d6jnZLqG--IJLnGEvvWaeawJCCO2CF",
            "I really thought it would be bad but actually its fun u can make videos watch people text and lots of other stuff its my fav app but there's 1 problem I had 4k followers and u took them away and idk how but now I have 1k followers but other than that its a great app! I would recommend getting it!😰",
            5,
            12,
            "21.2.5",
            1633440317000,
            null,
            null
        ],
        [
            "gp:AOqpTOEay4lU38rj-1Wa12RgSKVC8dgndtiNONxl1zfC63LKR9Nj6eXP42kA5xgZjNldN-hrR4Y7q_ZfjsRqEg",
            "Preston Matagi",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxmUwGJOrvb9d4Me95VxogYa8ElGiEWl8sxIu9c=mo",
            "So far so good, love the simple but effective editing tools and the many good creators on the platform. Would recommend",
            5,
            0,
            "21.3.41",
            1633957769000,
            null,
            null
        ],
        [
            "gp:AOqpTOGsUACRaD1Br-MjvUpbFre1hBxp9ASakqYd4Cd-ygbfhmsqmS0jSogllPunsYkN3_uWh8Jyz9BD5Q4OHA",
            "Angel Revlin Chosen",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiTkjxZV6SiH-0hyJu5NlzFbjlNPMvyqLLlugmwswM",
            "What I can say is Tiktok is the best App so far. It has nice content privacy. I really like this app, because it takes away my everyday stress",
            5,
            0,
            "21.3.41",
            1633954414000,
            null,
            null
        ],
        [
            "gp:AOqpTOHXl3uGEQHgXbMbcqBF_tIHe7CZVq__-HRXlQpl4jC8lMF8cI-CUgh7PeHCaBPEtVhQfLQbhNCkBd-bVg",
            "Rosanna Mock",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJw8AfX19WGj6SkLR3EbO1laUVqH7zU4ompckQUY=mo",
            "Tiktok is a good app its like youtube but short vids. And you can make your own vids to. I find this app a all out good app. And the adds Aren't really a bothered to me at least. You should really download tiktok thats it have a good good day. And I hope you find this reply helpful. And enjoy tiktok if you ever download it.",
            5,
            12,
            "21.2.5",
            1631978643000,
            null,
            null
        ],
        [
            "gp:AOqpTOHMO9f5YCsnX18P7D2c6g4A_QgSLb7iqOCyej1ExCHUMsMPgm6x4q6jnD6VdzL6IWs4DgMSbzPYjyHG9g",
            "April L",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJyJrMK5fR6fIt5_nMQlE_K-DEZ2JEZNZpbPTnKm=mo",
            "Always fun. Its easy to lose track of time watching videos. Not to mention making videos are so much fun with the different filters and sounds",
            5,
            33,
            "21.5.2",
            1633183074000,
            null,
            null
        ],
        [
            "gp:AOqpTOFQX5uqpfR5Hx0QPi_qTnZL2dzFPXsecHfY9AdBOuu5ICEKIPwx-9xrxFb19h_mrHu5qFdryIGHvc5_rw",
            "Yuve P",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwJMIz5rEE1LX-0IVhN3KxbmCRyHKU-zJZk__3b=mo",
            "Highly addictive. Great tool for short videos and promoting products or services. Also a great app for losing time.",
            5,
            16,
            "21.2.5",
            1632793283000,
            null,
            null
        ],
        [
            "gp:AOqpTOEVw636GlP0XUiJTJtmdZDIlVd7JYKC2-xWtka3hY0NpVGYYtup1-VM2m3AmO0NvGea6IyaVi1Baxk4pA",
            "Marie Berberian",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj7gR4R-WijO-gZOKGt7fTucnHdCzSC7Lw94dmNpQ",
            "I love this app i can watch the videos ALL DAY its so entertaining i watch it in class while im eating just généraly im on tiktok 24\\7. And when i watch tiktok it makes me laugh and smile.I dont even use youtube or Instagram anymore cuz im always on tiktok. But the only thing i wanna tiktok to fix its that i wish we could like or follow or comment without having an account but beside that i love this app and i consider it to everyone and its not only for teens its for everyone.",
            5,
            4,
            "21.3.41",
            1633629707000,
            null,
            null
        ],
        [
            "gp:AOqpTOG0UmyGmLETqvOFBg-YsgrJyyJMbWufFp5_kx2WAWBm0QWyuuerJwBOudNZ5XYej-qInR_fs_6Jqgp8Hw",
            "Barbara Stokes",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhFH7OvXZi94GaVRh2Gg7Zs2q4zIxKvatorCLzz1jE",
            "I have been on this app several months now and really enjoy it. After a few days it began suggesting videos that interest me. Very easy to navigate.",
            5,
            4,
            "21.3.41",
            1633505501000,
            null,
            null
        ],
        [
            "gp:AOqpTOGAvlJNI6g1IV0BGnCdh-Lutd9wNECKaz6vGXeCsvrr1WPLgHcahBOq_8T_0KsjOFZfUuR2B4IM0bp2YQ",
            "Jadacapri Epps Edwards",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi1PyDd5fKvjz4ZlfoJQjiI0OHLo0trtkvdUeT3",
            "Love, love, love this app!!! Cannot wait to make my own tic tok video. Great learning app for the newbies and safe and understanding by the oldies. Everyone can enjoy the app.",
            5,
            87,
            "21.3.2",
            1632029280000,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team.",
            1632349671000
        ],
        [
            "gp:AOqpTOGzFKpcDNjHzSPnDN0L3SbhUN84wL8FPv_FfbfNLeDHrgaLf9BTY1f30mUsFUjlJ5xHJ4eAaCIG2tcihQ",
            "JP Walker",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gi4LVwmSGUDeX-uI1tCV0KsfO6zZ5-_5BEdRl_jYg",
            "Well everyone else is being censored and Truth is not being heard it is so refreshing to see so many on point messages never new tiktok was this great! And the ads are not so obnoxious loud and screaming and long and you can flip right through if you're not interested and I've actually seen a few decent ads and bought something.",
            5,
            12,
            "21.2.5",
            1632219772000,
            null,
            null
        ],
        [
            "gp:AOqpTOGQ7-SdmBq88DR3kM_Uck2ZLAm1Gg1ygWLbtCbkDGM7q08PrPzgyOnFfoMiyz3zN2G7_Y0qvu09-z0QTA",
            "Nurselife Young",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GghwduNOt-cV7CazpFWkYR2lchz-4ZJkT6Vu2k_Iyk",
            "Lose time for sure 😜😜, so much to see and do! Very addictive. I have to put a timer on sometimes..",
            5,
            5,
            "21.3.41",
            1633548483000,
            null,
            null
        ],
        [
            "gp:AOqpTOHLMBHJDJPntW752heXG-dNv_uPWcprNWEwMqcTo6pDO0PJM2bVfDw720h52HZiMRC5_qgiy5dahj6QOg",
            "Keira Thompson",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgqZIKgS217vEi3VmxwN17_eQLSaYK4X-TILye2",
            "It's amazing but when you report something it doesn't get taken down and when it updates it takes ages and kicks u off and it should auto update so when you go on it u don't need to wait for it to update",
            5,
            37,
            "21.3.41",
            1633170331000,
            null,
            null
        ],
        [
            "gp:AOqpTOG9DU8XW--49YQsG8BkX4IExXaTZ-QObdiKzdq7Wsbxs-giTKuGD-MUvl6HUdpqaNUCY5hm2tZ9LyL-XA",
            "Sara Irvine",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhtQaXRMGC108sl0gGHYT12FlRqozE-6W37HPCJOJU",
            "Didn't realise musically changed to tiktok! It seems to be more popular for some reason 🤔😏 31 😲 and I love it lol not got the confidence or rhythm to make any but enjoy watching anyhow. I start to watch tiktok 🤓 and before I know it I've been watching videos for hours ⏰ and my fone is ready to die 😲🔋⚰️",
            5,
            6,
            "21.3.4",
            1633497877000,
            null,
            null
        ],
        [
            "gp:AOqpTOEvtJoUXkTsJLszcTUBt0NOzgX9YuyorBuACZRthqxZVA2BN0vUW5LK_xQsVdhY-HortSIFrd3AVYZtGg",
            "Maria Elina FLO-ROBERSON",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjanM3DawfVOqg4RM3nIznG0njN7mSjhznRGbTYxA",
            "I can watch this app for hours, and it's very helpful too with it hacks and for very good recipes and the cooks.",
            5,
            0,
            "21.5.6",
            1633958558000,
            null,
            null
        ],
        [
            "gp:AOqpTOF4h7GMDwruOToWX4YJ8REksKs7ERgKfv4-PG2YIEiZtyfPuB8-ndL36jSvY4squTCSj5IWKy3V91r5zw",
            "Roxanne Esquivel",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgVrDmNzaI1k5IPuI9rMC_VY0atGZViFETLiwQbdg",
            "I love this app. I have no problems. I love seeing videos. Recently I fell in too depression, but since I downloaded this app it help me so much. So thank you.",
            5,
            27,
            "21.2.5",
            1632027524000,
            null,
            null
        ],
        [
            "gp:AOqpTOFIhemOkaGNGzhZl6pQyAN_IVk8x0_UPfP5G_BKdntzkcdp2rTWTJ8yZJPhRoWxUTUJyW47xsi-SK4sIQ",
            "Celeste Mason",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzi2VRD0uxAUWlBzowkUsE7-PmmQb4mQtivrU16=mo",
            "Giving this 5 stars because they'll probably ban my account if I don't 🤷‍♀️ I love the app but the moderators will block your account without warning. Additionally not allowing you to request contact to unblock you regardless as to if you've accidentally or purposefully uploaded content that breaches the guidelines. If accidental, they won't allow you the opportunity to fix the issue.",
            5,
            1065,
            "21.3.41",
            1633825740000,
            null,
            null
        ],
        [
            "gp:AOqpTOF8sRlHFmnH-YFKSekMM4iyGE_ZcoBY2eTDGnvXwAjtJB2iOr5-zTiQGJbMb6VpJcAjjtM_dx5W5kQ_7Q",
            "George B",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhNVwj--gb235pyI7jfQbmvxsixgD-9ey3KxOqjYg",
            "Did not quite know what I was getting into. Excellent platform for organic views and for interest based algorithms. Impressed and surprised.",
            5,
            4,
            "21.3.41",
            1633452680000,
            null,
            null
        ],
        [
            "gp:AOqpTOFqp4RilhcB6g2cuxNItsKDnELIBJrLzKYBSCtfMqv0dJAwsi1vNup5wL1AmY5dcssP4ng60J4mEt3EMw",
            "Des iree",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJy2_MgJkfJ1wjiQksRW9W9y4Q2qmHXQ8OHs6kzG=mo",
            "Straight up addicting but can be helpful. I wish I could save videos by category in the app though...cooking videos in one folder, animal videos in another, and so on",
            5,
            7,
            "21.3.4",
            1632958896000,
            null,
            null
        ],
        [
            "gp:AOqpTOEjdVWak4n-jgne4JpnRrTgpnGwrHVzj2j6mCoGjIzP2VmnwW8pTq0ktP5s9qbN-4RrcP7jA9Ld9haMhg",
            "Itzel Torres",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gg8GJS0x92e6tpsw2JV1prsP9entrhANI1oSEXoPQ",
            "I get to chat with my friends when they don't have a number or they can't for reasons because some phones don't have any like phone numbers so it helps:)But there are some problems but it worked out",
            5,
            5,
            "21.2.5",
            1632172777000,
            null,
            null
        ],
        [
            "gp:AOqpTOEco6uyLMrjgEhXuYD2DydKGtx_PpWHS6vHJdfolNhFO0nBjPvpzRVpwempBh99IQNn-zEDUppcgNCS9Q",
            "Caleb Janse van Vuuren",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gjv3nzw7QS9YHVa29M7IWQUIjFXCHAVv-C1h4Ah",
            "It's a amazing app not just for watching videos but for making them becoming popular and live streaming doing challenges and more I love this app in my opinion you should download it so have fun on this awesome social media platform 😀",
            5,
            2,
            "21.5.4",
            1633882978000,
            null,
            null
        ],
        [
            "gp:AOqpTOEJRVEcn8-4hWk5fLvCkd8FPbJf0nf9zdc0ZMlxfbXdBD5gqYcKsyp8sTSmpThqL8iVLMlJCSucaBCc8A",
            "Tom Medel",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwhQ2AXrpvtu-CslCcCaivlZVZauUpz27DgcCra=mo",
            "SOME bits are super cute, the majority right now aren't. Hopefully, the later will get bored and go away. TikTok is not to blame for content. I like your site. Thank you, Lisa Wedin",
            5,
            5,
            "21.2.5",
            1632159256000,
            null,
            null
        ],
        [
            "gp:AOqpTOF8vX8FtHET-Ye9Jv-DCiHVBfqJfmZhHGfmi9Yw18t1gjTdez3luVBj_o9Nbazv0aOShdIdAYl8UDNYzQ",
            "Dianne Spicer",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgnAWFaYFvmFiSX7m6yvJrj_96HscaLOecHjPpZ",
            "I enjoyed the recipes I also enjoy the makeup there is some funny stuff here but I don't usually watch that too often but I do enjoy it thank you so very much for sharing",
            5,
            30,
            "21.2.5",
            1631939450000,
            null,
            null
        ],
        [
            "gp:AOqpTOGXTOqVgmDDnEpVchIhGTQWTH6al9q9h2wvbWLeK7R14nVIRPOeIADb4WZx6xKHFxdv3eL-24nkJn7d5w",
            "Ibrahiem Fredericks",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJzKjbgP-SZxoWJa3b3sooiXEZKyTo6XM4ElnM7Q=mo",
            "Very addictive but not to the point that you cannot stop yourself from watching. Also amazing for learning new things",
            5,
            13,
            "21.2.5",
            1632895627000,
            null,
            null
        ],
        [
            "gp:AOqpTOFJPg1cha0e670zOqO8zO6qyES8-N2Li6pD7I_2uF8-ho1asPBWWN9igLxHY6Lj08kSXUSwxMrbXmA_EQ",
            "Kev Kev",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJykTj5x7FU0IMRm0vk1zBRQE3kmx6imoSRx_tE4=mo",
            "Fun and engaging app! Clever way to connect creative people with like-minded people and entertaining creators who mutually support each other just having fun.",
            5,
            5,
            "21.2.5",
            1632692352000,
            null,
            null
        ],
        [
            "gp:AOqpTOH2SbOV73qshSrD9JqDeA4O09uJKZI_lTl1vge1U__IkL13m_7lmWm4lZ0c0u1AYqL5Z0z-xosvNSymtA",
            "taylor english",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJynDjvnMfALqNtHiQNdImLRGSt4swXQrU9CoU0s=mo",
            "Almost perfect I just wish i could make folders for the literal thousands of videos I have and could sort them into seperate folder like have one for lifehacks and one for cat and or one for dog videos and stuff like that, tiktok makers if you could please make this happen or teach me how to make folders that would be great",
            5,
            17,
            "21.2.5",
            1632100931000,
            null,
            null
        ],
        [
            "gp:AOqpTOF03gJuqQfc_53c_Dxu5pFi5KXYhkkEXfCdoTgFXbiNB9nalFyPXiKEuyTBImqEARLzgZqajg6Me3mvJw",
            "wroof wroof",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GgXnBB4uI-XFmU7y3KEMkZ5VDw6sy0oI32_siuH",
            "Tik Tok was so much awesome than I thought it would be like.Its pretty fun and so awesome of course. I never saw a bug in TikTok until now. I started loving TikTok in just 2 days of using....I love it.",
            5,
            14,
            "21.2.5",
            1632359443000,
            null,
            null
        ],
        [
            "gp:AOqpTOGXrC2gwxNPyHA4RJHpCUkJXjnSkQBIcp-sdXp5sQ7ulAxoE7Zfo_5x533E9947pleiygyiEni3JaKYew",
            "SSEGONGA KEVIN",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhIZI22PRg1UlW51osQAAuHFhBaiRiAsGix1i4",
            "Best app ever.lt really connects people all over the world.And it's fun to have. It's a must have for everyone....it's a 10\/10 for me",
            5,
            0,
            "21.5.6",
            1633949436000,
            null,
            null
        ],
        [
            "gp:AOqpTOG5DzyTstsr_tbwAR25QDE0OnIvRQQH41xGHJtcrhKnqxPkWgW0v6kwWqewKvCuAjNGI39knXrwpD1JzA",
            "Azrael Mairsile",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjLJJjXI3qrBD9XEPqhGL7Kp4LNuUCPiZhDVV0-",
            "I swear I am constantly looking up new videos for everything. Especially ones with animals, or someone dancing. I love this app.",
            5,
            49,
            "21.5.1",
            1632881859000,
            null,
            null
        ],
        [
            "gp:AOqpTOHh-XmKEg4fS9UtR5oJoLRC4uMAh-YywZftUBEwR--u2HrD5k3cU6wjncheAlH_-4IUux3Y7L8EPWpvKw",
            "Winyela Ceta",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GilnXMOSggGBbftLLceYW-9emBdljkY_7SRZhLz",
            "A really fun app. I love that your home feed actually adapts to what you like.",
            5,
            0,
            "21.5.6",
            1633884360000,
            null,
            null
        ],
        [
            "gp:AOqpTOEA9_jTs8IaV8Bja7Ic5n7iz7Lyqs0_yu0wnYf_g1RpYUEj6cr2V6fSqWg4FhY2dbcdz2vr56Xfzog4_Q",
            "Luanne Alderman Crosby",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GixkdfY5_0Cf6MyUheQJ2mn-zwLeiczlUBLjSkiWYw",
            "Watching these videos puts a smile on my face..and sometimes I run across a tear jerker..I have gotten great meals and cleaning tips how to get rid of any kinda bug around..watch it daily.. hate putting it down.",
            5,
            7,
            "21.2.5",
            1632245192000,
            null,
            null
        ],
        [
            "gp:AOqpTOEf3U9Rj_r7iQKcmSyOgBi23IvBAMs57wOgb6acfl1LxRjPoXmKgSb-F-Gh8tsGufTlnKx6-hbNUk_QOg",
            "Priceless Gift",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gjiy1sxKzBaGX5YHFpVdQhUtR98aKcm_i-eZ5b5Uw",
            "I'm really enjoying this App, I'm always smiling every time I go on Tiktok. If you really want to kill boredom, depression or wanna lift your soul with positive vibes just to to TIKTOK.",
            5,
            30,
            "21.2.5",
            1632837083000,
            null,
            null
        ],
        [
            "gp:AOqpTOEpOIOK_o35dny7rwVpDoX607owpI_SEVTTC-fwDK0f-wAyts3qhG5Hc97HiG8wlNrdexpO4l9YIIpLfA",
            "direxxx official",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhgdPyEz6nTSk8lftrT8IKiDDgic52PKKEC3jFl",
            "Fun app to use Good for creating editing and watching videos The live streams are lit and I just love the app I've been using it since lockdown and I've had zero problems with the app Definitely worth it",
            5,
            8,
            "21.5.4",
            1633761579000,
            null,
            null
        ],
        [
            "gp:AOqpTOHdkL2JOUpcbH292INaDtPD4jr6gml26yAi8M5UGH6j6HVjmeieEuZzp-4G0mayyOx8IMK7g5209mR9ug",
            "Margaret. Ann Miller",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GjeWakdmD0FiNLsnWtSceNSAjMv6NDG2JcvUYQXBg",
            "Out of all the apps I really love going on Tick Tock they be having so many funny aniimal talking video,, people dancing routine,You can send heart or comment that you really love these video.I always go on Tick Tock to see how people put together these funny video.💖💖💖💖",
            5,
            14,
            "21.2.5",
            1631994481000,
            null,
            null
        ],
        [
            "gp:AOqpTOGlzOjVHcieQp4VKDg4EaX1xjDgG0Qim5VBx-OBX8VEJdww6LgaGU6-DkOJUYvdzhNXhjKgvqly40Kv6Q",
            "Destiny Horrall",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhD-4QnQOpCSn-y6w9cNgMWFZRYN6zsB4JvVHCFJA",
            "This is a fun app I love that you can make videos up to 3 minutes now I like some of the other updates it's up with I would totally recommend it I'm addicted to the stuff I'm only like 24\/7 and if I'm not on it I'm on a different app",
            5,
            42,
            "21.2.5",
            1631797920000,
            null,
            null
        ],
        [
            "gp:AOqpTOG9Zc_xnBLghqcyg4YaR12mcdvNN9vnd8VFW2zIOx3IQv3pdTKMCU1yxMqjJqbpkKpmEBGGyZVNqqrx8A",
            "Adam Jacobs",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJxlGsRZZVez1grGs1hIqr3cTYESmRs24fLEnwTf=mo",
            "Omg!this app is amazing😀it has so much vids for you and entertainment...i don't have any problems with it..you can make your own vids and post..the best of all is you can save your videos you LIKE!!",
            5,
            27,
            "21.2.5",
            1632417334000,
            null,
            null
        ],
        [
            "gp:AOqpTOFo56ZyNukOvDtBRbATWueh5BnM3fwD7jJ81pZJwBismhmmfVjNuNotS3338LSlC0eG56af8iXlTh1pNg",
            "its Bokuto",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GhCrd54CYf1GYXzsYwbElSnYhcW8LLXyoWsW-Ilsw",
            "Its a great app i like that you can skip past the ads and that they dont pop out at you out of no where its great i can post when ever i want.but you do need wifi or phone scervice to upload a video or watch the videos.",
            5,
            29,
            "21.5.3",
            1633038034000,
            null,
            null
        ],
        [
            "gp:AOqpTOGtPr6AEHRSsId1D8p7WuBzrWGE4CqOCzipP1gp6UOYPQWXaWdDjbFB4UCAXE6xWboO7WxZg4iCqotd_w",
            "Samaya Gutierrez",
            "https:\/\/play-lh.googleusercontent.com\/a\/AATXAJwG22pHmLWd_mDQl04JMV8Ox9_Gl0U2UgGKAK2C=mo",
            "I love it is so good and you can learn more stuff like storytimes and it gives you ideas what to do anything at so good I wrote recommended it is so good I can't stop thinking about it and that guy 24\/7 I'm on there It's fun stuff even you can do lots of stuff like record yourself do anything can you see stuff AP weird but overall it's so good I give it a five Stars bye y'all",
            5,
            7,
            "21.3.4",
            1633173041000,
            null,
            null
        ],
        [
            "gp:AOqpTOFv3CbNXTnz2vW24H1R4M51q3QSY4Tg3iIIfZuUH0PaHUo-JXiXhV_QN3QdGhzHz34aijMtIG9uG0-HgA",
            "Hugh Franklin",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GinrFA48ysCIjWP2dinqqQQ0dSaCeG8Ijus_aSEmg",
            "I think it brings me joy and if I'm on a game I would be bored and stuff but sometimes it has inappropriate content but I dont find it all the time but it does no make me bored but sometimes I am bored from it so I'll watch yt you know so sometimes I find it offensive and scary but nothing is wrong with that so it makes me happy you know so yea.",
            5,
            6,
            "21.3.41",
            1633124062000,
            null,
            null
        ],
        [
            "gp:AOqpTOHctcR1-Kwj5H3H6IXi5nNsxqKkZZFwngp0yfTC4VvYWXzQ2YWqv0e7xDuXpqSjD4SLwzCgWjDpN7xffw",
            "MøonPie Gacha",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14Gj7DBaoGeHkyqpYVYQ8HWtLWGQzzKD6POhWlwkcog",
            "I loved this app so much but although it keeps bringing me to lives I don't want to join and I personally get mad about that so could you remove the live thing on the fyp instead just keep it in notifications. Love you Tiktok Community!",
            5,
            10,
            "21.3.41",
            1633259721000,
            null,
            null
        ],
        [
            "gp:AOqpTOHB6spslECMXAvNIs6YZoC9ePHjg2MHyzhZdveR1znGEJDdtLzNUN088r51gAHP1xsDd7AHnsg5JNz__g",
            "Shawn Acorn",
            "https:\/\/play-lh.googleusercontent.com\/a-\/AOh14GiolsRDl_s6VfwsueezVsAiKsOyYJGWcsGkVZW_NiY",
            "Really a great app! I can reach an new audience and encourage people how to make their own great tasting food without preservatives.",
            5,
            7,
            "21.2.5",
            1632232547000,
            null,
            null
        ]
    ]
}