{
    "columns": [
        "userName",
        "content",
        "score",
        "thumbsUpCount",
        "replyContent"
    ],
    "index": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        10,
        11,
        12,
        14,
        17,
        21,
        22,
        44,
        55,
        62,
        65,
        71,
        111,
        114,
        120,
        168
    ],
    "data": [
        [
            "Rebekka Kaleja",
            "Recently when I upload videos it just isn't uploading them. I still get the video on my phone so i know i uploaded it but when I check it's not there. This happened to me 3 times in the last week And i always have to find the Sound again then add the saved video and then post it again because it's also not available in my drafts anymore. Edit: the response worked and after the next update the issue was completely gone",
            5,
            548,
            "Hi, sorry for the inconvenience. Could you please provide the issue details within the TikTok app via the following steps: 1) Go to your profile page 2) Tap on the button on the top right corner 3) Choose \"Report a Problem\" on the \"Privacy and Settings\" page. Thanks, TikTok team"
        ],
        [
            "Kelly Nauert",
            "I wish I could stop the live feeds from showing up. I also wish there was a way to exclude sponsored videos (not ads, I don't mind an occasional ad, but actual posts by other people that are sponsored are way too frequent.)",
            5,
            500,
            "Hi, thanks for your valuable feedback. TikTok team is committed to promoting a safe and positive environment. We respect your feedback and will continuously improve our advertising. Best regards, TikTok team"
        ],
        [
            "Sharon Braxton",
            "Cute and fun, it seems like when i start watching these, i fall down a rabbit hole & lose all track of time, the doggone things are ADDICTIVE! The Beverly Halls, the Beestrom family (w\/the little girls \"eyeboos\" is hysterical) and Sebastian w\/his \"the scary thing about...\" vids....i could go on & on...but instead I'll finish this up by saying TikTok you've come a long way from just silly dance videos!! Rock on!!!",
            5,
            174,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ],
        [
            "Cloudpaint",
            "Its awesome. It's a bit annoying that a don't get the exact videos that i want on my for you page but i suppose it's supposed to work like that.😃 The suggested search is annoying and I really wish there was a little tab to pull on so you could quickly get to the bottom of your favorites. It's a geeat app though.",
            5,
            88,
            "Hi, thanks for choosing TikTok, your feed is personalized to you based on the videos you liked in the past. Be sure to like videos to see more similar ones and long tap Not interested that you don't want to see in your feed, which will quickly influence your feed with the stuff you want to see!"
        ],
        [
            "tushemereirwe kellen",
            "I have had a blast of happiness with TikTok,an amazing app that connects people all over the world.Tiktok is the best app so far one can use to socialize with people,get to know what they think infact it digs into their mind which has helped individuals discover their talents and selves,am really happy to be part of this platform because it relaxes my mind and displaces boredom that comes from all corners. But the administration should be aware of people who report accounts without proper truth",
            5,
            140,
            "Hi, thanks for choosing TikTok, your feed is personalized to you based on the videos you liked in the past. Be sure to like videos to see more similar ones and long tap Not interested that you don't want to see in your feed, which will quickly influence your feed with the stuff you want to see!"
        ],
        [
            "Joselyne Kategaya",
            "Great app, much fun , I got many friends there, I just want you to get serious with nudidy there, and people who attack others, otherwise well done, it's one of the best apps, stress killer, another thing is about us who have no iphones , you can't use your song from your phone, if you can improve on that, we are good to go, otherwise well done we really appreciate. Looking forward for more features , new and funny stickers and effects Otherwise I enjoy it daily,have learnt alot,we appreciate al",
            5,
            140,
            "Hi, thanks for your valuable feedback. We listen to and value your opinions and suggestions. If you find any inappropriate content, please report it within the app. We will review the content and take actions immediately to promote a safe and positive environment for all our users. Best regards, TikTok Team."
        ],
        [
            "Shamirah nakyanzi",
            "It's the best app I have in my phone,my stress killer, boredom taker .it's super amazing 🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰I can't spend any day without using TikTok,this app is so wonderful.even if I don't have data atleast I borrow 🤣🤣🤣🤣 OMG the way I love this app is extra ordinary.everywhere I go I have to be active on TikTok, updating people where am are,what am doing and what next🥰🥰🥰",
            5,
            112,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ],
        [
            "Sarah Anotinette Russo",
            "Hate this app. Barely use it. It took up so much storage. Very inappropriate. Download it to see if my daughter was allowed install it. I thought it was appropriate, but days later there are videos with people naked! Please don't download. I don't even understand why there is even this app. It should get taken down. I personally think it's the worst app for the age is allowed for. If I could give this a 0 star, I would. Very inappropriate words in the videos and comments too! People can messageu",
            5,
            5278,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team."
        ],
        [
            "Sevda K_D",
            "I really like it! Is a really great app and the FYP never ends, soo you could watch for hours and yeah! I would definitely recommend! There could be some bugs that could be fixed but overall, this app is amazing!",
            5,
            315,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ],
        [
            "《Suki Suki》",
            "This app is incredible! I love it so much, you can do so many things on it! If I had to rate it out of ten it would be a thousand out of ten. The only thing I wish of this app Is for a history of videos you have watched just in case 😂 otherwise I love this app a lot it is fantastic.",
            5,
            667,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ],
        [
            "Fik Right",
            "Tik Tok is the best app in my phone. In Tik Tok there is filters where by they can make u to. change your naturality so thats good on my side. And also in this beautiful app it has good ads where by letters are readle so Tik Tok is good for me Even the it has good sign and colour for easy identification Its easy because it has futures like that sign + we all know to make videos we use that sign Its easy hw u can make a challenge with out making your own video And I can contact friends usingit",
            5,
            112,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ],
        [
            "Jacinta Manning",
            "I love this app it makes me smile 😊 everything is grate some problems but the biggest one is that there's a photo crop filter but it croppes inappropriate areas of the body and is scaring people there is probably even a death story I heard about this filter but there is other problems but other than that I am so happy with it and hope one day I will get 1K followers this is a good to get app , worth downloading but there are bad adds one called: \"get laid\" there's kids on tt abt stripping👎🏼",
            5,
            461,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team."
        ],
        [
            "Carlos Rodriguez",
            "Using TikTok has helped me maintain my sobriety through creating music videos. I know it may seem odd saying an app could help in rehabilitation. However, it impacts my life in a positive way to stay away from the streets and focus in something bright like dancing and spending time creating these videos rather than getting high in the alley....",
            5,
            245,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ],
        [
            "Sandy Knight",
            "I love this app. However, my daughter does TicTocs that gets taken down when others are showing alot more skin and sexually provocative material that doesn't get taken down. I have a serious issue with that. It seems like people with alot of followers are looked past for doing very sexually explicit scenes. Please be fair to EVERYONE. 🙂",
            5,
            192,
            "Hi, sorry for the unpleasant experience. If your video contains inappropriate content or violates our community regulation as specified in FAQ https:\/\/www.tiktok.com\/community-guidelines?lang=en, this video will be removed. We hope to see more good content from you! Thanks, TikTok Team."
        ],
        [
            "Artese Johnson",
            "Still learning the ropes. I'm older and each new platform takes me a good min and several YouTube tutorials to understand what to do, hence the 2 star rating under the optional \"Tell us more\" question about the ease of use. Once I learn, I'll re-rate it.",
            5,
            424,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team."
        ],
        [
            "Asiah smith",
            "Great app works really well so many features so many new features lots of popular trends and so many things you can do on the app like find friends, post videos, get likes ,Duets, shares, and so much more so yes or even get sponsored on tik tok besides all the scams the app is pretty content and sometimes the foryou page won't load but other than that it's a great app that continues to improve so yes 5 Stars",
            5,
            278,
            "Hi, sorry for the inconvenience. Could you please provide the issue details within the TikTok app via the following steps: 1) Go to your profile page 2) Tap on the button on the top right corner 3) Choose \"Report a Problem\" on the \"Privacy and Settings\" page. Thanks, TikTok team"
        ],
        [
            "Dolendra Chhetry",
            "I love TikTok, but I have an Android and the recent update made my experience horrible! Now I can barely post, I can't see video without having restarted my hope this gets fixed soon! Also, they should make it so that anyone can go LIVE, not just user over 1K.",
            5,
            302,
            "Hi, sorry for the inconvenience. Could you please provide the issue details within the TikTok app via the following steps: 1) Go to your profile page 2) Tap on the button on the top right corner 3) Choose \"Report a Problem\" on the \"Privacy and Settings\" page. Thanks, TikTok team"
        ],
        [
            "Julianna Rigali",
            "I love everything about the app, but when trying to edit your bio, you can no longer add links for link trees for example. I would like to add a link tres but I can't like I was able to before. other than that, it's a good app.",
            5,
            189,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team."
        ],
        [
            "Kayla607 Wright",
            "Tiktok is amazing it's a rlly a place were I can vent out from. I also wanna suggest something. Can you add a feature wear in record thing you can search filters. I think it would make things easier instead of scrolling for hours to fing the right filter.",
            5,
            113,
            "Hi, thanks for the great suggestions! We will be sure to share your suggestions with our product team for consideration. TikTok team is committed to promoting a better user experience. Thanks, TikTok Team."
        ],
        [
            "Lisa Parke",
            "Love it ...But I think that more is definately needed in regards to locking people and banning them for certain amounts of time. A lot of people who should have a penalty get away with it not sure if its the people with more who follow and have followers and their videos are liked . Also the money side to buy followers and the more you spend the more your videos get shown I really feel that's unfair for people who financially meet that sort of money. It really does seem to happen lisa 🙂🙂🙂",
            5,
            180,
            "Hi, if you received a notification from TikTok that your account has been suspended, it means that your account may violate TikTok's Community Guidelines. For more information, please go to: https:\/\/www.tiktok.com\/community-guidelines?lang=en, Thanks, TikTok Team."
        ],
        [
            "Mint Julip",
            "It's a great app. Around the clock there's always something on entertaining. I only wish for TikTok not to allow trolls to do as they please when reported. It should be a violation for a troll to be hateful, racist, anti-LGBQ and told no violation has been made. Thank you.",
            5,
            31,
            "Hi, thanks for your valuable feedback. We listen to and value your opinions and suggestions. If you find any inappropriate content, please report it within the app. We will review the content and take actions immediately to promote a safe and positive environment for all our users. Best regards, TikTok Team."
        ],
        [
            "Luna Wolfy!",
            "It's pretty Good app! I even started an account that went viral! I did not expect it. No problems with Tiktok at all but I made a video about something and tiktok deleted because they didn't like what I said and what I said was not bad, Tiktok doesn't know me so please don't delete any video of mine",
            5,
            123,
            "Hi, sorry for the unpleasant experience. If your video contains inappropriate content or violates our community regulation as specified in FAQ https:\/\/www.tiktok.com\/community-guidelines?lang=en, this video will be removed. We hope to see more good content from you! Thanks, TikTok Team."
        ],
        [
            "TheFormlessBlob",
            "It works pretty well except for the past week my DMs have been broken. I get the push notifications but they don't show up in the app even when I've refreshed and updated. Update: Everything is now working smoothly 👍",
            5,
            35,
            "Hi, sorry for the inconvenience. This issue has now been fixed by our product team. If the problem persists, please don't hesitate to contact us within the TikTok app via the following steps: 1) Go to your \"Profile\" page 2) Tap on the button on the top right corner 3) Choose \"Report a problem\" on the \"Settings and privacy\" page. Thanks, TikTok team"
        ],
        [
            "Jadacapri Epps Edwards",
            "Love, love, love this app!!! Cannot wait to make my own tic tok video. Great learning app for the newbies and safe and understanding by the oldies. Everyone can enjoy the app.",
            5,
            87,
            "Hi, thanks for the high rating. TikTok team will continue to work hard to bring you a better experience. Your support is highly appreciated! Thanks, TikTok Team."
        ]
    ]
}